[
    {
        "abstract": "This paper describes the game engine of the forthcoming game generation system titled The Game-O-Mat. As underlying game engines strongly constrain the space of possible games that a generator can create, the goal of this paper is to fully document the design considerations and features of this game engine that was designed with game generation as a priority. This paper is aimed at helping future developers of game generation systems.",
        "authors": "Mike Treanor",
        "bibtex": "@inproceedings{treanor2021engine,\n title={A Component-based Game Engine for the Game-O-Mat Game Generation System},\nauthor={Mike Treanor},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://exag.org/archive/treanor2021engine.pdf",
        "local_file": "papers/A Component-based Game Engine for the Game-O-Mat Game Generation System.pdf",
        "old_url": "archive/treanor2021engine.pdf",
        "title": "A Component-based Game Engine for the Game-O-Mat Game Generation System",
        "year": "2021"
    },
    {
        "abstract": "Non-representational art-such as works by Wassily Kandinsky, Joan Mitchell, Willem de Kooning, etc.-showcases diverse artistic expressions and challenges viewers with its interpretive open-endedness and lack of a clear mapping to our everyday reality. Human cognition and perception nonetheless aid us in making sense of, reasoning about, and discussing the perceptual features prevalent in such non-representational art. While there have been various Computational Creative systems capable of generating representational artwork, only a few existing Computational (Co)Creative systems for visual arts can produce non-representational art. How would a co-creative AI that incorporates elements of the human visual perception theory be able to collaborate with a human in co-creating a non-representational art? This paper explores this challenge in detail, describes potential machine learning and non-machine learning approaches for designing an AI agent and introduces a new web-based, multi-agent AI drawing application, called Drawcto, capable of co-creating non-representational artwork with human collaborators.",
        "authors": "Manoj Deshpande and Brian Magerko",
        "bibtex": "@inproceedings{deshpande2021draw,\n title={Drawcto: A Multi-Agent Co-Creative AI for Collaborative Non-Representational Art},\nauthor={Manoj Deshpande and Brian Magerko},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://ceur-ws.org/Vol-3217/paper7.pdf",
        "local_file": "papers/Drawcto: A Multi-Agent Co-Creative AI for Collaborative Non-Representational Art.pdf",
        "old_url": "archive/deshpande2021draw.pdf",
        "title": "Drawcto: A Multi-Agent Co-Creative AI for Collaborative Non-Representational Art",
        "year": "2021"
    },
    {
        "abstract": "Generative Graph grammars are an established technique for procedural content generation (PCG) of the mission space of dungeon levels, as they allow for explicit specification of design intention. However, they are difficult to control beyond the initial specification. Defining effective grammars requires both design expertise and familiarity with how grammars work, and even then the resulting grammar is not guaranteed to generate missions that fit a designer's intention. In this paper, we propose a system that attempts to allow designers to affect an existing grammar's generative space by allowing designers to control the probability distribution induced by the grammar. The system does this by learning the parameters of a probabilistic graph grammar from examples. Designers can control the generation of these examples via specification of assessment criteria, and a threshold above or below which the output is generated. We conclude with a demonstration of the efficacy of the system in shifting the distribution of the generative space.",
        "authors": "Abdelrahman Madkour, Stacy Marsella, Casper Harteveld, Magy Seif El-Nasr and Jan Willem van de Meent",
        "bibtex": "@inproceedings{madkour2021guiding,\n title={Guiding Generative Graph Grammars of Dungeon Mission Graphs via Examples},\nauthor={Abdelrahman Madkour and Stacy Marsella and Casper Harteveld and Magy Seif El-Nasr and Jan Willem van de Meent},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://ceur-ws.org/Vol-3217/paper8.pdf",
        "local_file": "papers/Guiding Generative Graph Grammars of Dungeon Mission Graphs via Examples.pdf",
        "old_url": "archive/madkour2021guiding.pdf",
        "title": "Guiding Generative Graph Grammars of Dungeon Mission Graphs via Examples",
        "year": "2021"
    },
    {
        "abstract": "The Holodeck, a virtual reality simulator from the television show Star Trek, is known as the 'holy grail' of interactive narrative experiences. However, while there have been approaches to various components of a theoretical Holodeck, scene generation from dialogue is often overlooked. This paper introduces a prototype AI Holodeck application for scene generation, demonstrating the use of Natural Language Processing and a corpus of spatial data. The application creates scenes from user input text and fills those scenes with objects and relationships not explicitly defined by the user. This paper discusses potential use cases of scene generation in creating environments for interactive narrative, virtual reality, and other development opportunities.",
        "authors": "Jason Smith, Nazanin Alsadat Tabatabaei Anaraki, Atefeh Goloujeh, Karan Khosla and Brian Magerko",
        "bibtex": "@inproceedings{smith2021holodeck,\n title={Towards an AI Holodeck: Generating Virtual Scenes from Sparse Natural Language Input},\nauthor={Jason Smith and Nazanin Alsadat Tabatabaei Anaraki and Atefeh Goloujeh and Karan Khosla and Brian Magerko},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://exag.org/archive/smith2021holodeck.pdf",
        "local_file": "papers/Towards an AI Holodeck: Generating Virtual Scenes from Sparse Natural Language Input.pdf",
        "old_url": "archive/smith2021holodeck.pdf",
        "title": "Towards an AI Holodeck: Generating Virtual Scenes from Sparse Natural Language Input",
        "year": "2021"
    },
    {
        "abstract": "Behavior trees (BTs) are a popular method for modeling NPC and enemy AI behavior and have been widely used in commercial games. In this work, rather than use BTs to model game playing agents, we use them for modeling game design agents, defining behaviors as content generation tasks rather than in-game actions. Similar to how traditional BTs enable modeling behaviors in a modular and dynamic manner, BTs for PCG enable simple subtrees for generating parts of levels to be combined modularly to form complex trees for generating whole levels as well as generators that can dynamically vary the generated content. We refer to this approach as Procedural Content Generation using Behavior Trees, or PCGBT, and demonstrate it by using BTs to model generators for Super Mario Bros., Mega Man and Metroid levels as well as dungeon layouts and discuss several ways in which this paradigm could be applied and extended in the future.",
        "authors": "Anurag Sarkar and Seth Cooper",
        "bibtex": "@inproceedings{sarkar2021procedural,\n title={Procedural Content Generation using Behavior Trees (PCGBT)},\nauthor={Anurag Sarkar and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://arxiv.org/pdf/2107.06638",
        "local_file": "papers/Procedural Content Generation using Behavior Trees (PCGBT).pdf",
        "old_url": "archive/sarkar2021procedural.pdf",
        "title": "Procedural Content Generation using Behavior Trees (PCGBT)",
        "year": "2021"
    },
    {
        "abstract": "Procedural content generation (PCG) has seen relative widespread adoption in games and game development. While PCG methods are gaining traction in commercial games, there are comparatively fewer cases where PCG has been used to generate the game world, characters, and the narrative for a single game. We present our research, collaborating with a small independent game studio, on the design of a game engine designed to generate a world, characters, supporting quests and overarching narrative content for their upcoming game. We discuss our choice of game artificial intelligence algorithms, decisions made in designing our system, and our progress and implementation under the constraints and requirements given to us. We posit our system will generate a rich game world with an explainable world history for players to explore and quests to complete. We believe that our engine will meet their requirements increasing the replayability of the game, reducing the authorship burden, while providing the authors with significant control over quest and narrative structure.",
        "authors": "Brenden Lech, Sasha Azad, Jennifer Wellnitz, Joel Jonasson and Chris Martens",
        "bibtex": "@inproceedings{lech2021designing,\n title={Designing a Combined World and Story Procedural Content Generation Engine},\nauthor={Brenden Lech and Sasha Azad and Jennifer Wellnitz and Joel Jonasson and Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "http://ceur-ws.org/Vol-3217/paper12.pdf",
        "local_file": "papers/Designing a Combined World and Story Procedural Content Generation Engine.pdf",
        "old_url": "archive/lech2021designing.pdf",
        "title": "Designing a Combined World and Story Procedural Content Generation Engine",
        "year": "2021"
    },
    {
        "abstract": "Procedural content generation (PCG) algorithms pervade the world of game development. They are useful tools that allow creators to unshoulder a degree of authorial burden of non-trivial virtual worlds. Such a goal necessitates a well-defined model of what the algorithm is producing. In this work, a PCG system called TileTerror is presented that uses a model of horror constructed from a ludological analysis of well-known horror games to embed horror story features in a procedurally generated 2D tilemap. The horror features found in the ludology are separated into a distinct hierarchy: low-level features and high-level features. These features are used in conjunction with a procedurally generated tilemap to create an annotated map denoting candidate locations for strong horror moments. This system is evaluated using a series of pathfinding agents which score the annotated tilemap. TileTerror represents a first step into exploring what story elements can be embedded in procedurally generated constructs like 2D tilemaps.",
        "authors": "Arunpreet Sandhu, Kyle Mitchell and Joshua McCoy",
        "bibtex": "@inproceedings{sandhu2021tileterror,\n title={TileTerror: A System for Procedurally Generating 2D Horror Maps},\nauthor={Arunpreet Sandhu and Kyle Mitchell and Joshua McCoy},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://exagworkshop.institutedigitalgames.com/archive/sandhu2021tileterror.pdf",
        "local_file": "papers/TileTerror: A System for Procedurally Generating 2D Horror Maps.pdf",
        "old_url": "archive/sandhu2021tileterror.pdf",
        "title": "TileTerror: A System for Procedurally Generating 2D Horror Maps",
        "year": "2021"
    },
    {
        "abstract": "Making a game where the environments, characters, and story are all procedurally generated is a complex task. We are a small studio in Sweden trying to develop such a game for the mobile market (working title “Lance a Lot”). Our game adopts role-playing game conventions, such as an explorable world map, non-player characters, and quests. It is our aim to develop as our” story engine” a system capable of procedurally generating quests and narratives to guide the gameplay experience. Such a system would encourage",
        "authors": "Joel Jonasson, Brenden Lech, Sasha Azad and Chris Martens",
        "bibtex": "@inproceedings{jonasson2021intertwining,\n title={Intertwining World and Narrative Generation for a Mobile Roleplaying Game},\nauthor={Joel Jonasson and Brenden Lech and Sasha Azad and Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://ceur-ws.org/Vol-3217/paper2.pdf",
        "local_file": "papers/Intertwining World and Narrative Generation for a Mobile Roleplaying Game.pdf",
        "old_url": "archive/jonasson2021intertwining.pdf",
        "title": "Intertwining World and Narrative Generation for a Mobile Roleplaying Game",
        "year": "2021"
    },
    {
        "abstract": "AgentCraft is an entry for the Generative Design in Minecraft (GDMC) AI Settlement Generation Competition, including the optional Chronicle Generation challenge. It makes use of an agent-based simulation to organically produce a plausible settlement and a written history of the settlement's development. Uniquely, AgentCraft utilizes the HTTP Server version of the competition framework to show the agents constructing the settlement in real time-a visual technique that can't be achieved with the earlier MCEdit framework. In this paper, we aim to provide a point of reference for future agent-based settlement generators by describing how our competition entry works and discussing the benefits and downsides of the agent-based approach. Additionally, we propose a new optional challenge for the GDMC competition, centering on the development of settlement simulations whose inhabitants can be directly observed or interacted with by the player.",
        "authors": "Ari Iramanesh and Max Kreminski",
        "bibtex": "@inproceedings{iramanesh2021agentcraft,\n title={AgentCraft: An Agent-Based Minecraft Settlement Generator},\nauthor={Ari Iramanesh and Max Kreminski},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://escholarship.org/content/qt83p272pq/qt83p272pq.pdf",
        "local_file": "papers/AgentCraft: An Agent-Based Minecraft Settlement Generator.pdf",
        "old_url": "archive/iramanesh2021agentcraft.pdf",
        "title": "AgentCraft: An Agent-Based Minecraft Settlement Generator",
        "year": "2021"
    },
    {
        "abstract": "Current agents use communication in a collaborative setting, exchanging truthful information to achieve a common plan. This paper defines games where agents may exchange information about the physical situation (both fluents and action events), arbitrarily nested beliefs, and action consequences, to manipulate other agents for their own goals, i.e. guide the other agents' own reasoning and planning. We propose a model for an 'agent mind' that can cater for all these aspects through revisable, prioritized belief bases; goal recognition including epistemic situations; or planning including speech acts with structured content. We also discuss recent algorithms to address each one of them, and propose a concrete implementation for a future stage.",
        "authors": "Javier M. Torres",
        "bibtex": "@inproceedings{torres2021manipulation,\n title={An Agent Framework for Manipulation Games},\nauthor={Javier M. Torres},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://exag.org/archive/torres2021manipulation.pdf",
        "local_file": "papers/An Agent Framework for Manipulation Games.pdf",
        "old_url": "archive/torres2021manipulation.pdf",
        "title": "An Agent Framework for Manipulation Games",
        "year": "2021"
    },
    {
        "abstract": "Games currently feature simple models of morality and moral reasoning. These typically take the form of a simple binary opposition between good and evil, in which game actions are sorted into these categories, and reputation systems that track the reputation of players (and sometimes NPCs) with in-game factions based on the actions taken. This paper presents a more sophisticated model of moral reasoning based on Lakoff's metaphorical family models: the strict father and nurturant parent morality. This model utilizes more rapid, surface level categorization of different situations in moral categories, and deeper reasoning that characterizes situations in terms of their relationship to moral virtues as determined by the metaphor value system. This model is used in the experimental prototype Argument Box (AB), a social argument simulator where the player argues with clients visiting the shop. Arguments in AB center around the moral virtues and vices of simulated characters in the social simulation Talk Of the Town. This paper presents the current architecture, discussing its technical details.",
        "authors": "Rehaf AlJammaz, Yasheng She and Michael Mateas",
        "bibtex": "@inproceedings{aljammaz2021argument,\n title={Argument Box},\nauthor={Rehaf AlJammaz and Yasheng She and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://ceur-ws.org/Vol-3217/paper9.pdf",
        "local_file": "papers/Argument Box.pdf",
        "old_url": "archive/aljammaz2021argument.pdf",
        "title": "Argument Box",
        "year": "2021"
    },
    {
        "abstract": "Data is becoming an important central point for making design decisions for most software. Game development is not an exception. As data-driven methods and systems start to populate these environments, a good question is: can we make models developed from this data transparent to users? In this paper, we synthesize existing work from the Intelligent User Interface and Learning Science research communities, where they started to investigate the potential of making such data and models available to users. We then present a new area exploring this question, which we call Open Player Modeling, as an emerging research area. We define the design space of Open Player Models and present exciting open problems that the games research community can explore. We conclude the paper with a case study and discuss the potential value of this approach.",
        "authors": "Jichen Zhu and Magy Seif El-Nasr",
        "bibtex": "@inproceedings{zhu2021open,\n title={Open Player Modeling: Empowering Players through Data Transparency},\nauthor={Jichen Zhu and Magy Seif El-Nasr},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://arxiv.org/pdf/2110.05810",
        "local_file": "papers/Open Player Modeling: Empowering Players through Data Transparency.pdf",
        "old_url": "archive/zhu2021open.pdf",
        "title": "Open Player Modeling: Empowering Players through Data Transparency",
        "year": "2021"
    },
    {
        "abstract": "Artificial Intelligence has been applied to many facets of the game design and development process. Though this has led to many advances in games and AI research, there remain few examples of games in which play centers around engagement with AI processes: the design space of AI-based games remains underexplored. By examining a breadth of playful experiences through different lenses, it is determined that games which forefront AI are beneficial for players, designers, and for the field of game scholarship itself. Moreover, there is evidence that symbolic approaches (rather than statistical) lend themselves to experiences with more agency, greater human interpretability, and more controlled authorability.",
        "authors": "Ben Samuel, Mike Treanor and Joshua McCoy",
        "bibtex": "@inproceedings{mccoy2021design,\n title={Design Considerations for Creating AI-based Gameplay},\nauthor={Ben Samuel and Mike Treanor and Joshua McCoy},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2021}}",
        "link": "https://ceur-ws.org/Vol-3217/paper10.pdf",
        "local_file": "papers/Design Considerations for Creating AI-based Gameplay.pdf",
        "old_url": "archive/mccoy2021design.pdf",
        "title": "Design Considerations for Creating AI-based Gameplay",
        "year": "2021"
    },
    {
        "abstract": "This work aims to present the principles from the game design perspective and lessons learned of two techniques adopted for solving the NPC behavior in casual language-oriented games in a Reinforcement Learning discrete and partially observable environment. It might be useful for other game developers as it offers an example of designing companionship in NPCs from the game perspective and to speed up their developments for implementing machine learning in NPC players, showing that a designed heuristic function and Imitation Learning approach can speed up developments with respect to a Reinforcement Learning approach for a deterministic output.",
        "authors": "Gema Parreno Piqueras",
        "bibtex": "@inproceedings{parreno2020benchmarking,\n title={Benchmarking Imitation and Reinforcement Learning for NPC players in casual video games},\nauthor={Gema Parreno Piqueras},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper4.pdf",
        "local_file": "papers/Benchmarking Imitation and Reinforcement Learning for NPC players in casual video games.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper4.pdf",
        "title": "Benchmarking Imitation and Reinforcement Learning for NPC players in casual video games",
        "year": "2020"
    },
    {
        "abstract": "'Tokamak Elementary' is a game built around a custom conversational engine. The player can talk with 'Toki', the AI-controlled character as with a chatbot. Toki is a gentle spirit creature summoned from the world of spirits. As such, Toki starts from a mostly clean slate and it's up to the player to teach them basic concepts of our world (such as what animals are) and how to interact with humans (such as returning greetings).",
        "authors": "Daniel Darabos, Gyorgy Lajtai and Andras Nemeth",
        "bibtex": "@inproceedings{darabos2020visual,\n title={Tokamak Elementary: Visual Novel Meets Natural Language Understanding},\nauthor={Daniel Darabos and Gyorgy Lajtai and Andras Nemeth},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://ceur-ws.org/Vol-2862/paper1.pdf",
        "local_file": "papers/Tokamak Elementary: Visual Novel Meets Natural Language Understanding.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper1.pdf",
        "title": "Tokamak Elementary: Visual Novel Meets Natural Language Understanding",
        "year": "2020"
    },
    {
        "abstract": "Tabletop games come in a variety of forms, including board games, card games, and dice games. In recent years, their complexity has considerably increased, with many components, rules that change dynamically through the game, diverse player roles, and a series of control parameters that influence a game's balance. As such, they also encompass novel and intricate challenges for Artificial Intelligence methods, yet research largely focuses on classical board games such as chess and Go. We introduce in this work the Tabletop Games (TAG) framework, which promotes research into general AI in modern tabletop games, facilitating the implementation of new games and AI players, while providing analytics to capture the complexities of the challenges proposed. We include preliminary results with sample AI players, showing some moderate success, with plenty of room for improvement, and discuss further developments and new research directions.",
        "authors": "Raluca D. Gaina, Martin Balla, Alexander Dockhorn, Raul Montoliu, and Diego Perez-Liebana",
        "bibtex": "@inproceedings{gaina2020tabletop,\n title={TAG: A Tabletop Games Framework},\nauthor={Raluca D. Gaina and Martin Balla and Alexander Dockhorn and Raul Montoliu and and Diego Perez-Liebana},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://repositori.uji.es/xmlui/bitstream/handle/10234/196729/gaina_2020_tag.pdf?sequence=1&isAllowed=y",
        "local_file": "papers/TAG: A Tabletop Games Framework.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper9.pdf",
        "title": "TAG: A Tabletop Games Framework",
        "year": "2020"
    },
    {
        "abstract": "Procedural content generation via Machine Learning (PCGML) creates game levels from examples. PCGML for platformers with physics-based player movement generally has not guaranteed the reachability of goals, relying on post-generation filtering approaches or game-specific heuristic rules. In contrast, constraint-based PCGML can provide gameplay guarantees, but has typically been applied to games with simple grid-based movement. In this work, we present a constraint-based PCGML approach for platformers with physics-based player movement that guarantees playability and provides design controllability. Our approach exhaustively precomputes all possible player movement states in example tile-based platformer levels. It extracts metatiles containing local state information and uses them in constraint-based level generation that ensures legal tile neighbors and consistent movement state transitions. The approach can ensure constraints on gameplay, such as the reachability of goals, guaranteeing level playability, and other elements like platforms and bonuses. It can also incorporate other designer-controllable constraints.",
        "authors": "Vivian Lee, Nathan Partlan and Seth Cooper",
        "bibtex": "@inproceedings{lee2020movement,\n title={Precomputing Player Movement in Platformers for Level Generation with Reachability Constraints},\nauthor={Vivian Lee and Nathan Partlan and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper13.pdf",
        "local_file": "papers/Precomputing Player Movement in Platformers for Level Generation with Reachability Constraints.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper13.pdf",
        "title": "Precomputing Player Movement in Platformers for Level Generation with Reachability Constraints",
        "year": "2020"
    },
    {
        "abstract": "Prior research has shown variational autoencoders (VAEs) to be useful for generating and blending game levels by learning latent representations of existing level data. We build on such models by exploring the level design affordances and applications enabled by conditional VAEs (CVAEs). CVAEs augment VAEs by allowing them to be trained using labeled data, thus enabling outputs to be generated conditioned on some input. We studied how increased control in the level generation process and the ability to produce desired outputs via training on labeled game level data could build on prior PCGML methods. Through our results of training CVAEs on levels from Super Mario Bros., Kid Icarus and Mega Man, we show that such models can assist in level design by generating levels with desired level elements and patterns as well as producing blended levels with desired combinations of games.",
        "authors": "Anurag Sarkar, Zhihan Yang and Seth Cooper",
        "bibtex": "@inproceedings{sarkar2020generation,\n title={Conditional Level Generation and Game Blending},\nauthor={Anurag Sarkar and Zhihan Yang and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://arxiv.org/pdf/2010.07735",
        "local_file": "papers/Conditional Level Generation and Game Blending.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper16.pdf",
        "title": "Conditional Level Generation and Game Blending",
        "year": "2020"
    },
    {
        "abstract": "Several recent PCGML methods have focused on generating game levels and content that blend the properties of multiple games. However, these works ignore the fact that blended levels must in some way have blended physics models that enable playable levels. In this work, we present an approach for extracting jump physics models for such blended game domains. We make use of variational autoencoders (VAEs) trained on level data from six platformers, encoded using a previously introduced path and affordance vocabulary. Our results show that the extraction model is able to reasonably recreate the original physics models when given ground truth paths, and is able to produce physics models that can reliably allow an agent to play the generated levels. We also find that there are promising results for blended physics models behaving intuitively between physics models of the original games being blended.",
        "authors": "Adam Summerville, Anurag Sarkar, Sam Snodgrass and Joseph Osborn",
        "bibtex": "@inproceedings{summervill2020physics,\n title={Extracting Physics from Blended Platformer Game Levels},\nauthor={Adam Summerville and Anurag Sarkar and Sam Snodgrass and Joseph Osborn},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://ceur-ws.org/Vol-2862/paper11.pdf",
        "local_file": "papers/Extracting Physics from Blended Platformer Game Levels.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper11.pdf",
        "title": "Extracting Physics from Blended Platformer Game Levels",
        "year": "2020"
    },
    {
        "abstract": "In this paper we describe the Sharp Multi-input Editing Software (SMES), a prototype system which allows players to convert dexterity challenges to planning challenges in existing games. SMES accomplishes this by recording the player input, displaying it in a visual form, allowing the player to edit the recorded playtrace, and replay the edited sequence back again. Our system combines ideas from tool-assisted speedruns (TAS) with interaction design patterns from Casual Creators and Accessible Player Experiences. Because our implementation is based on intercepting input events at the operating system level, no engineering effort is needed to apply the tool to new games. The result is a new mode of play for existing games that further allows players to realize new behaviors in the game. SMES could support making games more inclusive by letting players adapt the challenge type they face. Furthermore we claim that AI systems that operate over playtraces to assist the player is a rich avenue to explore.",
        "authors": "Batu Aytemiz and Adam M. Smith",
        "bibtex": "@inproceedings{aytemiz2020smes,\n title={SMES: Adapting Dexterity-based Games for Deliberative Play},\nauthor={Batu Aytemiz and Adam M. Smith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper2.pdf",
        "local_file": "papers/SMES: Adapting Dexterity-based Games for Deliberative Play.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper2.pdf",
        "title": "SMES: Adapting Dexterity-based Games for Deliberative Play",
        "year": "2020"
    },
    {
        "abstract": "Procedural Content Generation via Machine Learning (PCGML) refers to a group of methods for creating game content (e.g. platformer levels, game maps, etc.) using machine learning models. PCGML approaches rely on black box models, which can be difficult to understand and debug by human designers who do not have expert knowledge about machine learning. This can be even more tricky in co-creative systems where human designers must interact with AI agents to generate game content. In this paper we present an approach to explainable artificial intelligence in which certain training instances are offered to human users as an explanation for the AI agent's actions during a co-creation process. We evaluate this approach by approximating its ability to provide human users with the explanations of AI agent's actions and helping them to more efficiently cooperate with the AI agent.",
        "authors": "Faraz Khadivpour and Matthew Guzdial",
        "bibtex": "@inproceedings{khadivpour2020responsibility,\n title={Explainability via Responsibility},\nauthor={Faraz Khadivpour and Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://arxiv.org/pdf/2010.01676",
        "local_file": "papers/Explainability via Responsibility.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper7.pdf",
        "title": "Explainability via Responsibility",
        "year": "2020"
    },
    {
        "abstract": "A key concern for procedural level generation is ensuring that generated levels are in fact playable. One approach for determining playability is using pathfinding agents to test if generated levels can be completed. This typically involves following an iterative loop of generating candidate levels until the agent is able to successfully complete a playthrough, discarding the failed level and starting the generation process over each time the agent fails. In this paper, we present a new approach for generating playable levels that leverages pathfinding agents, not to simply test levels for playability, but to perform level repair to fix generated levels that are unplayable. By augmenting a simple pathfinding agent to be able to take moves that would require modifying the level, our approach can fix unplayable levels without having to regenerate a new level from scratch. We compared our repair agent to a default agent on three PCGML level generators each for Super Mario Bros. and Kid Icarus, and found the repair agent was able to fix the majority of levels, taking time that ranged from similar to the default agent to around 4x its time.",
        "authors": "Seth Cooper and Anurag Sarkar",
        "bibtex": "@inproceedings{cooper2020pathfinding,\n title={Pathfinding Agents for Platformer Level Repair},\nauthor={Seth Cooper and Anurag Sarkar},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper6.pdf",
        "local_file": "papers/Pathfinding Agents for Platformer Level Repair.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper6.pdf",
        "title": "Pathfinding Agents for Platformer Level Repair",
        "year": "2020"
    },
    {
        "abstract": "In this paper, we describe an approach to procedurally generating abridged game levels. We present a design pattern-based method for abridging a collection of Super Mario Bros. levels. These design patterns are salient regions that users describe as memorable after playing original Mario levels. We use the Mario AI Framework and Mawhorter and Mateas's Occupancy-Regulated Extension (ORE) generator to generate 20 abridged levels based upon 3 original levels from Super Mario Bros. We conduct a preliminary study for 2 abridged levels and compare the play experience with the original levels' play experience. We also compare these abridged levels to those created by previous level generators using the same patterns. Finally, we offer a critical reflection of the process taken to generate these levels, and the assumptions and values inherent in this design pattern-based approach.",
        "authors": "Varun Prakash Bhat and Gillian Smith",
        "bibtex": "@inproceedings{prakash2020abridging,\n title={Towards Automatically Abridging Game Levels},\nauthor={Varun Prakash Bhat and Gillian Smith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://ceur-ws.org/Vol-2862/paper14.pdf",
        "local_file": "papers/Towards Automatically Abridging Game Levels.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper14.pdf",
        "title": "Towards Automatically Abridging Game Levels",
        "year": "2020"
    },
    {
        "abstract": "Procedural content generation via machine learning (PCGML) has shown success at producing new video game content with machine learning. However, the majority of the work has focused on the production of static game content, including game levels and visual elements. There has been much less work on dynamic game content, such as game mechanics. One reason for this is the lack of a consistent representation for dynamic game content, which is key for a number of statistical machine learning approaches. We present an autoencoder for deriving what we call 'entity embeddings', a consistent way to represent different dynamic entities across multiple games in the same representation. In this paper we introduce the learned representation, along with some evidence towards its quality and future utility.",
        "authors": "Nazanin Yousefzadeh Khameneh and Matthew Guzdial",
        "bibtex": "@inproceedings{khameneh2020embedding,\n title={Entity Embedding as Game Representation},\nauthor={Nazanin Yousefzadeh Khameneh and Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://arxiv.org/pdf/2010.01685",
        "local_file": "papers/Entity Embedding as Game Representation.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper15.pdf",
        "title": "Entity Embedding as Game Representation",
        "year": "2020"
    },
    {
        "abstract": "In game development, designing compelling visual assets that convey gameplay-relevant features requires time and experience. Recent image generation methods that create high-quality content could reduce development costs, but these approaches do not consider game mechanics. We propose a Convolutional Variational Autoencoder (CVAE) system to modify and generate new game visuals based on their gameplay relevance. We test this approach with Pokemon sprites and Pokemon type information, since types are one of the game's core mechanics and they directly impact the game's visuals. Our experimental results indicate that adopting a transfer learning approach can help to improve visual quality and stability over unseen data.",
        "authors": "Adrian Gonzalez, Matthew Guzdial and Felix Ramos",
        "bibtex": "@inproceedings{gonzalez2020relevant,\n title={Generating Gameplay-Relevant Art Assets with Transfer Learning},\nauthor={Adrian Gonzalez and Matthew Guzdial and Felix Ramos},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://arxiv.org/pdf/2010.01681",
        "local_file": "papers/Generating Gameplay-Relevant Art Assets with Transfer Learning.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper10.pdf",
        "title": "Generating Gameplay-Relevant Art Assets with Transfer Learning",
        "year": "2020"
    },
    {
        "abstract": "Scenes in 2D videogames generally consist of a static terrain and a set of dynamic sprites which move around freely. AI systems that aim to understand game rules (for design support or automated gameplay) must be able to distinguish moving elements from the background. To this end, we re-purposed an object detection model from deep learning literature, developing along the way YOLO Artificial Retro-game Data Synthesizer, or YARDS, which efficiently produces semi-realistic, retro-game sprite detection datasets without manual labeling. Provided with sprites, background images, and a set of parameters, the package uses sprite frequency spaces to create synthetic gameplay images along with their corresponding labels.",
        "authors": "Chanha Kim, Jaden Kim and Joseph C. Osborn",
        "bibtex": "@inproceedings{kim2020screenshots,\n title={Synthesizing Retro Game Screenshot Datasets for Sprite Detection},\nauthor={Chanha Kim and Jaden Kim and Joseph C. Osborn},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper8.pdf",
        "local_file": "papers/Synthesizing Retro Game Screenshot Datasets for Sprite Detection.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper8.pdf",
        "title": "Synthesizing Retro Game Screenshot Datasets for Sprite Detection",
        "year": "2020"
    },
    {
        "abstract": "Many recent generative text systems combine a context-free grammar base with some set of extensions such as tagging or inline JavaScript.  We argue that the restriction to CFGs is unnecessary and that the standard pattern-directed, nondeterministic control structures common to Prolog, definite-clause grammars, and many HTNs, support a superset of these capabilities while still being simple to implement.  We describe Step,  a  generative text  system  for Unity games based  on higher-order HTNs that so far as we can determine from published descriptions, generalizes this previous work.  We then describe syntactic extensions to make Step more natural as a text-authoring language.  Finally, we discuss how Step and similar systems can be implemented very compactly in modern mainstream programming languages. ",
        "authors": "Ian Horswill",
        "bibtex": "@inproceedings{horswill2020classical,\n title={Generative Text using Classical Nondeterminism},\nauthor={Ian Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "https://ceur-ws.org/Vol-2862/paper3.pdf",
        "local_file": "papers/Generative Text using Classical Nondeterminism.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper3.pdf",
        "title": "Generative Text using Classical Nondeterminism",
        "year": "2020"
    },
    {
        "abstract": "Dynamic quest generation is a topic of interest in the game AI community, with examples appearing in AAA games (Lenhardt 2012), indie games (Coxon 2016), and academia (Sullivan et al. 2012). In July 2018, we released an update to our simulative science fantasy roguelike Caves of Qud (Freehold Games 2015) that added its own take on dynamically generated villages and quests. These systems were built on top of a framework we previously developed for generating historical biographies (Grinblat and Bucklew 2017). Like that framework, our approach to dynamic quest generation-novel in the space as far as we know-was shaped primarily by two design forces at work in the project's development. The first is an architectural constraint; to support its large-scale game worlds, Caves of Qud uses a two-phase approach to world creation (Bucklew and Grinblat 2019) that delays the full fabrication of game 'zones' until the player enters them. The quest generation system was necessarily designed to fit this two-tiered architecture. The second is an aesthetic choice of procedural content design; we tend to be nonprescriptive in deciding which of our content modules can be procedurally combined, preferring instead to 'let our generators run wild,' as we say, but ensure that they smooth the rough edges off their output. For our storyful generators, this means eschewing causal logic in favor of randomness that's parameterized by the richly narrative world the generators are embedded in. The resulting outputs are ripe for apophenic readings.",
        "authors": "Jason Grinblat and C. Brian Bucklew",
        "bibtex": "@inproceedings{grinblat2020warm,\n title={Warm Rocks for Cold Lizards: Generating Meaningful Quests in Caves of Qud},\nauthor={Jason Grinblat and C. Brian Bucklew},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper5.pdf",
        "local_file": "papers/Warm Rocks for Cold Lizards: Generating Meaningful Quests in Caves of Qud.pdf",
        "old_url": "http://ceur-ws.org/Vol-2862/paper5.pdf",
        "title": "Warm Rocks for Cold Lizards: Generating Meaningful Quests in Caves of Qud",
        "year": "2020"
    },
    {
        "abstract": "Stealth games challenge players to complete tasks while remaining unnoticed by enemies. Modern versions often provide players with the ability to silently eliminate enemies, inducing a puzzle-like nature to the task which combines finding a path to the goal with the need to discover an order in which enemies can be eliminated. This 'take-down' problem is made more complex by the need to hide the resulting enemy body from future observation. We present a version of a sample-based search that can find paths respecting the stealth constraints of both the take-down and body-hiding mechanics, including multiple variations that address different ways these problems are expressed in games. As a perhaps surprising outcome of our analysis, we show that an additional body-hiding problem can improve the success rate, despite the apparent increase in task complexity.",
        "authors": "Jorge Morales Diaz, Clark Verbrugge",
        "bibtex": "@inproceedings{diaz2019takedown,\n title={Solving the Take-Down and Body-Hiding Problems},\nauthor={Jorge Morales Diaz and Clark Verbrugge},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://escholarship.mcgill.ca/downloads/9c67ws147",
        "local_file": "papers/Solving the Take-Down and Body-Hiding Problems.pdf",
        "old_url": "archive/diaz2019takedown.pdf",
        "title": "Solving the Take-Down and Body-Hiding Problems",
        "year": "2019"
    },
    {
        "abstract": "In this paper we introduce DeepCrawl, a fully-playable Rogue-like prototype for iOS and Android in which all agents are controlled by policy networks trained using Deep Reinforcement Learning (DRL). Our aim is to understand whether recent advances in DRL can be used to develop convincing behavioral models for non-player characters in videogames. We begin with an analysis of requirements that such an AI system should satisfy in order to be practically applicable in video game development, and identify the elements of the DRL model used in the DeepCrawl prototype. The successes and limitations of DeepCrawl are documented through a series of playability tests performed on the final game. We believe that the techniques we propose offer insight into innovative new avenues for the development of behaviors for non-player characters in video games, as they offer the potential to overcome critical issues with classical approaches.",
        "authors": "Alessandro Sestini, Alexander Kuhnle, Andrew D. Bagdanov",
        "bibtex": "@inproceedings{sestini2019deepcrawl,\n title={DeepCrawl: Deep Reinforcement Learning for Turn-based Strategy Games},\nauthor={Alessandro Sestini and Alexander Kuhnle and Andrew D. Bagdanov},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://arxiv.org/pdf/2012.01914",
        "local_file": "papers/DeepCrawl: Deep Reinforcement Learning for Turn-based Strategy Games.pdf",
        "old_url": "archive/sestini2019deepcrawl.pdf",
        "title": "DeepCrawl: Deep Reinforcement Learning for Turn-based Strategy Games",
        "year": "2019"
    },
    {
        "abstract": "Motivation establishes the framework within which goals are pursued. Different characters are motivated differently based on their personality, emotions, relationships, and social norms. In this paper, we propose a motivation model that incorporates these concepts into multi-agent narrative planning. Using our model, characters automatically adopt new goals, find plans to achieve those goals, and choose between those plans based on their personality.",
        "authors": "Alireza Shirvani, Stephen G. Ware",
        "bibtex": "@inproceedings{shirvani2019motivating,\n title={On Automatically Motivating Story Characters},\nauthor={Alireza Shirvani and Stephen G. Ware},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/shirvani2019motivating.pdf",
        "local_file": "papers/On Automatically Motivating Story Characters.pdf",
        "old_url": "archive/shirvani2019motivating.pdf",
        "title": "On Automatically Motivating Story Characters",
        "year": "2019"
    },
    {
        "abstract": "Tarot decks appeared as early as the 14th century. Once used as a game deck, today it is primarily used as a divination medium. One attempt to adapt the fortune-telling claims to modern technological pragmatism: the selection of card imagery are a representation of the omni-homo, or the every-human, or a collective consciousness, such that a card reading session becomes an interactive resurfacing of subconscious, but preexisting, knowledge. We suggest that perhaps when we create Tarot decks we are also creating a representation of the collective consciousness, in a manner of speaking. We provide a procedure of doing this creation from text-mining and take a look at the resulting artifact.",
        "authors": "Asiiah Song",
        "bibtex": "@inproceedings{song2019tarot,\n title={Generative Tarot: Internet-Mining for the Collective Consciousness},\nauthor={Asiiah Song},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/song2019tarot.pdf",
        "local_file": "papers/Generative Tarot: Internet-Mining for the Collective Consciousness.pdf",
        "old_url": "archive/song2019tarot.pdf",
        "title": "Generative Tarot: Internet-Mining for the Collective Consciousness",
        "year": "2019"
    },
    {
        "abstract": "Let's Plays of video games represent a relatively unexplored area for experimental AI in games. In this short paper, we discuss an approach to generate automated commentary for Let's Play videos, drawing on convolutional deep neural networks. We focus on Let's Plays of the popular game Minecraft. We compare our approach and a prior approach and demonstrate the generation of automated, artificial commentary.",
        "authors": "Shukan Shah, Matthew Guzdial, Mark O. Riedl",
        "bibtex": "@inproceedings{shah2019letsplay,\n title={Automated Let's Play Commentary},\nauthor={Shukan Shah and Matthew Guzdial and Mark O. Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://arxiv.org/pdf/1909.02195",
        "local_file": "papers/Automated Let's Play Commentary.pdf",
        "old_url": "archive/shah2019letsplay.pdf",
        "title": "Automated Let's Play Commentary",
        "year": "2019"
    },
    {
        "abstract": "Visualizing game mechanics is an important way for game developers to refine, review, and improve their work, and to facilitate communication between designers and programmers. This challenge has seen many different manual and automatic approaches, but they have been either too abstract and distant from the game, too close to the actual code, or lacking in connections to the code. We propose a modular system that can semi-automatically build and display a graphical representation of a given game's mechanics, to stimulate reasoning about the dependencies between the game's variables. We present an initial implementation of this visualization tool, which can read a graph from a user-made file and partition it based on user parameters. We also discuss a pilot evaluation of the tool's capacities for creative support.",
        "authors": "Jacopo Ameli, David Thue",
        "bibtex": "@inproceedings{ameli2019mechanics,\n title={Visualizing Game Mechanics with Automated Clustering},\nauthor={Jacopo Ameli and David Thue},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exagworkshop.institutedigitalgames.com/archive/ameli2019mechanics.pdf",
        "local_file": "papers/Visualizing Game Mechanics with Automated Clustering.pdf",
        "old_url": "archive/ameli2019mechanics.pdf",
        "title": "Visualizing Game Mechanics with Automated Clustering",
        "year": "2019"
    },
    {
        "abstract": "Cooperation between human players and AI agents in games is a subject of great interest in the research community. In this paper we propose a new domain as a challenge for future AI research: the cooperative game Pandemic. This game represents a challenge because it requires cooperation between players in an environment with incomplete information. Additionally, we propose a first approach for a cooperative agent for the game, that uses planning in conjunction with plan recognition. We also propose an experiment to test the mentioned approach. In this paper we argue why Pandemic makes a compelling domain for AI research, the status of our project, as well as which challenges remain to be addressed.",
        "authors": "Pablo Sauma Chacon, Markus Eger",
        "bibtex": "@inproceedings{chacon2019pandemic,\n title={Pandemic as a Challenge for Human-AI Cooperation},\nauthor={Pablo Sauma Chacon and Markus Eger},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/chacon2019pandemic.pdf",
        "local_file": "papers/Pandemic as a Challenge for Human-AI Cooperation.pdf",
        "old_url": "archive/chacon2019pandemic.pdf",
        "title": "Pandemic as a Challenge for Human-AI Cooperation",
        "year": "2019"
    },
    {
        "abstract": "One of the key benefits of a machine learning system is the fact that it can adapt, change, and learn with more experience. However, pre-trained algorithms forfeit this benefit, because continued play does not continue to impact the AI's performance. With Lab Assistant, the team had two goals: to include human-driven training as part of the game loop, and to create an emotional bond between the artificial intelligence and the player. The game can be accessed for free at the website: https://lizfiacco.itch.io/lab-assistant.",
        "authors": "Liz Fiacco",
        "bibtex": "@inproceedings{fiacco2019lab,\n title={Development of Lab Assistant: Use of Neural Networks in Video Games for Human-AI Partnership},\nauthor={Liz Fiacco},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://scholar.archive.org/work/b6vyb7fkmfgubd2q4mwaic5vze/access/wayback/https://dl.acm.org/doi/pdf/10.1145/3542698",
        "local_file": "papers/Development of Lab Assistant: Use of Neural Networks in Video Games for Human-AI Partnership.pdf",
        "old_url": "archive/fiacco2019lab.pdf",
        "title": "Development of Lab Assistant: Use of Neural Networks in Video Games for Human-AI Partnership",
        "year": "2019"
    },
    {
        "abstract": "Procedurally generating high-quality content is an important problem in the design and development of video games. A key objective of procedural level generation is controllability: the ability to generate novel levels with a predetermined goal, such as maximizing difficulty. Previous work has achieved this for platformer games using deep-learning and evolutionary methods, but such methods often lead to invalid or asymmetric structures within the generated levels. On the other hand, generative approaches using LSTMs and Markov chains have succeeded in preserving local coherence but suffer from limited controllability. In this paper, we introduce a framework for generating controllable and locally coherent levels in platformer games. Our framework extends a prior GAN and evolutionary strategy-based approach with LSTM Recurrent Neural Networks and hyperparameter optimization. We use sequence transformation via a LSTM to improve aesthetic coherency, while tuning fitness function hyperparameters for specific objectives and measuring overall level quality through human evaluation. To verify our approach, we create levels for Super Mario Bros intended to be novel and challenging to expert players. We demonstrate that the framework is able to successfully generate such levels in a controllable manner, while also resolving invalid and unaesthetic local structures.",
        "authors": "Justin Mott, Saujas Nandi, Luke Zeller",
        "bibtex": "@inproceedings{nandi2019pronged,\n title={Controllable and Coherent Level Generation: A Two-Pronged Approach},\nauthor={Justin Mott and Saujas Nandi and Luke Zeller},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/nandi2019pronged.pdf",
        "local_file": "papers/Controllable and Coherent Level Generation: A Two-Pronged Approach.pdf",
        "old_url": "archive/nandi2019pronged.pdf",
        "title": "Controllable and Coherent Level Generation: A Two-Pronged Approach",
        "year": "2019"
    },
    {
        "abstract": "In level co-creation an AI and human work together to create a video game level. One open challenge in level co-creation is how to empower human users to ensure particular qualities of the final level, such as challenge. There has been significant prior research into automated pathing and automated playtesting for video game levels, but not in how to incorporate these into tools. In this demonstration we present an improvement of the Morai Maker mixed-initiative level editor for Super Mario Bros. that includes automated pathing and challenge approximation features.",
        "authors": "Andrew Hoyt, Matthew Guzdial, Yalini Kumar, Gillian Smith, Mark O. Riedl",
        "bibtex": "@inproceedings{hoyt2019play,\n title={Integrating Automated Play in Level Co-Creation},\nauthor={Andrew Hoyt and Matthew Guzdial and Yalini Kumar and Gillian Smith and Mark O. Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://arxiv.org/pdf/1911.09219",
        "local_file": "papers/Integrating Automated Play in Level Co-Creation.pdf",
        "old_url": "archive/hoyt2019play.pdf",
        "title": "Integrating Automated Play in Level Co-Creation",
        "year": "2019"
    },
    {
        "abstract": "Previous work explored blending levels from existing games to create levels for a new game that mixes properties of the original games. In this paper, we use Variational Autoencoders (VAEs) for improving upon such techniques. VAEs are artificial neural networks that learn and use latent representations of datasets to generate novel outputs. We train a VAE on level data from Super Mario Bros. and Kid Icarus, enabling it to capture the latent space spanning both games. We then use this space to generate level segments that combine properties of levels from both games. Moreover, by applying evolutionary search in the latent space, we evolve level segments satisfying specific constraints. We argue that these affordances make the VAE-based approach especially suitable for co-creative level design and compare its performance with similar generative models like the GAN and the VAE-GAN.",
        "authors": "Anurag Sarkar, Zhihan Yang, Seth Cooper",
        "bibtex": "@inproceedings{sarkar2019variational,\n title={Controllable Level Blending between Games using Variational Autoencoders},\nauthor={Anurag Sarkar and Zhihan Yang and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://arxiv.org/pdf/2002.11869",
        "local_file": "papers/Controllable Level Blending between Games using Variational Autoencoders.pdf",
        "old_url": "archive/sarkar2019variational.pdf",
        "title": "Controllable Level Blending between Games using Variational Autoencoders",
        "year": "2019"
    },
    {
        "abstract": "Procedural content generation has been widely used for aiding game content designers in the content creation process. However, limited work has focused on autonomously generating novel physical gestures for non-player characters. This paper focuses on using creative strategies from theater and dance to enable the generation of novel movement sequences for characters in 3D game environments. We apply the Space component from Laban's Movement Analysis to procedurally improvise movements in virtual environments. Our framework outlines a pipeline for an improvisational AI that analyzes human movements in terms of the geometric properties of Laban's icosahedron and manipulates these projections to generate various alternative movements. In this paper, we mainly focus on describing the structural design and encoding scheme used in the framework. ",
        "authors": "Swar Gujrania, Duri Long, Brian Magerko",
        "bibtex": "@inproceedings{gujrania2019procedural,\n title={Moving in Virtual Space: A Laban-inspired Framework for Procedural Animation},\nauthor={Swar Gujrania and Duri Long and Brian Magerko},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/gujrania2019procedural.pdf",
        "local_file": "papers/Moving in Virtual Space: A Laban-inspired Framework for Procedural Animation.pdf",
        "old_url": "archive/gujrania2019procedural.pdf",
        "title": "Moving in Virtual Space: A Laban-inspired Framework for Procedural Animation",
        "year": "2019"
    },
    {
        "abstract": "Constraint programming offers a concise and powerful approach to a variety of procedural content generation problems (A. M. Smith & Mateas, 2011). However, it requires considerable technical expertise. No constraint-based PCG languages come close to Compton's goal of casual creators (Compton & Mateas, 2015). In this paper, we describe Imaginarium, an interactive environment for developing ontologies for constraint-based PCG, targeted toward players of tabletop role-playing games. The system allows players to interactively describe the ontologies of their games using an Inform-like English subset, and explore the spaces of artifacts they generate. While much less expressive than a full logic programming language, it is quite competitive in terms of conciseness and readability. ",
        "authors": "Ian Horswill",
        "bibtex": "@inproceedings{horswill2019tool,\n title={Imaginarium: A Tool for Casual Constraint-Based PCG},\nauthor={Ian Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/horswill2019tool.pdf",
        "local_file": "papers/Imaginarium: A Tool for Casual Constraint-Based PCG.pdf",
        "old_url": "archive/horswill2019tool.pdf",
        "title": "Imaginarium: A Tool for Casual Constraint-Based PCG",
        "year": "2019"
    },
    {
        "abstract": "We introduce gym-city, a Reinforcement Learning environment that uses SimCity 1's game engine to simulate an urban environment, wherein agents might seek to optimize one or a combination of any number of city-wide metrics, on gameboards of various sizes. We focus on population, and analyze our agents' ability to generalize to larger map-sizes than those seen during training. The environment is interactive, allowing a human player to build alongside agents during training and inference, potentially influencing the course of their learning, or manually probing and evaluating their performance. To test our agents' ability to capture distance-agnostic relationships between elements of the gameboard, we design a minigame within the environment which is, by design, unsolvable at large enough scales given strictly local strategies. Given the game engine's extensive use of Cellular Automata, we also train our agents to 'play' Conway's Game of Life - again optimizing for population - and examine their behaviour at multiple scales. To make our models compatible with variable-scale gameplay, we use Neural Networks with recursive weights and structure - fractals to be truncated at different depths, dependent upon the size of the gameboard.",
        "authors": "Sam Earle",
        "bibtex": "@inproceedings{earle2019neural,\n title={Using Fractal Neural Networks to play SimCity 1 and Conway's Game of Life at Variable Scales},\nauthor={Sam Earle},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://arxiv.org/pdf/2002.03896",
        "local_file": "papers/Using Fractal Neural Networks to play SimCity 1 and Conway's Game of Life at Variable Scales.pdf",
        "old_url": "archive/earle2019neural.pdf",
        "title": "Using Fractal Neural Networks to play SimCity 1 and Conway's Game of Life at Variable Scales",
        "year": "2019"
    },
    {
        "abstract": "'Bosses' - powerful, difficult enemies - have been a part of video games for the majority of their existence. Despite their integral role in many games, they have rarely been the focus of study. Cuphead is a run-and-gun style 2D action game with a large pool of boss battles, making it an ideal game for comparing and contrasting bosses, to determine what makes a compelling (or frustrating) boss battle. In this case study, we developed an ontology of 'shoot-em-up'-genre attacks and bosses. With this system for codifying a boss battle, we cluster the attacks using a Gaussian Mixture Model - which are then used to represent a boss as a 'bag-of-attacks'. We then use multinomial regression to predict the player experience of a boss given the parameterized boss.",
        "authors": "Andrew Wood, Adam Summerville",
        "bibtex": "@inproceedings{wood2019battles,\n title={Understanding Boss Battles: A Case Study of Cuphead},\nauthor={Andrew Wood and Adam Summerville},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exag.org/archive/wood2019battles.pdf",
        "local_file": "papers/Understanding Boss Battles: A Case Study of Cuphead.pdf",
        "old_url": "archive/wood2019battles.pdf",
        "title": "Understanding Boss Battles: A Case Study of Cuphead",
        "year": "2019"
    },
    {
        "abstract": "Videogames are created for human players whose common-sense knowledge of real-world objects and interactions (and their familiarity with other games) primes them for successful play. Action games feature recurring formal elements including a directly controlled avatar, moving enemies, resource pickups, and portals to new map areas; mapping these onto culturally significant symbols helps players learn to play quickly. We present a schema, annotation tool, and dataset for codifying screenshots containing game objects in terms of their affordances, which is suitable for AI agents and machine learning algorithms for a variety of interesting and significant applications.",
        "authors": "Gerard R. Bentley, Joseph C. Osborn",
        "bibtex": "@inproceedings{bentley2019affordances,\n title={The Videogame Affordances Corpus},\nauthor={Gerard R. Bentley and Joseph C. Osborn},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://exagworkshop.institutedigitalgames.com/archive/bentley2019affordances.pdf",
        "local_file": "papers/The Videogame Affordances Corpus.pdf",
        "old_url": "archive/bentley2019affordances.pdf",
        "title": "The Videogame Affordances Corpus",
        "year": "2019"
    },
    {
        "abstract": "As a field of study, Experience Management spans a set of technology that is becoming increasingly relevant in applications that aim to improve the experiences of their users. Given the youth of the field, however, few attempts have been made to identify and discuss the common elements of systems that manage user experiences as they occur. In this paper, we consider a subset of existing AI experience managers in the context of a shared conceptual framework. We offer directly comparable summaries of the managers that we discuss, and we highlight how some of them use different technologies to perform similar tasks. While many experience managers remain undiscussed, we nonetheless demonstrate that distinct, well-defined components exist across a diverse set of managers, and that a modular method for building new managers might well be within reach.",
        "authors": "Giulio Mori, David Thue, Stephan Schiffel",
        "bibtex": "@inproceedings{mori2019management,\n title={A Structured Analysis of Experience Management Techniques},\nauthor={Giulio Mori and David Thue and Stephan Schiffel},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/5241/5097/",
        "local_file": "papers/A Structured Analysis of Experience Management Techniques.pdf",
        "old_url": "archive/mori2019management.pdf",
        "title": "A Structured Analysis of Experience Management Techniques",
        "year": "2019"
    },
    {
        "abstract": "Deceptive games are games where rewards are designed to lead agents away from a global optimum policy. In this paper, we have developed a deceptive generator that generated three different type of traps including greedy, smoothness and generality trap. The generator was successful in generating levels for a large set of games in the General Video Game Level Generation Framework. Our experimental results show that all tested agents were vulnerable to several kinds of deceptions.",
        "authors": "Adeel Zafar, Hasan Mujtaba, Mirza Omer Beg, Sajid Ali",
        "bibtex": "@inproceedings{zafar2018deceptive,\n title={Deceptive Level Generator},\nauthor={Adeel Zafar and Hasan Mujtaba and Mirza Omer Beg and Sajid Ali},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ceur-ws.org/Vol-2282/EXAG_105.pdf",
        "local_file": "papers/Deceptive Level Generator.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_105.pdf",
        "title": "Deceptive Level Generator",
        "year": "2018"
    },
    {
        "abstract": "Procedural level generation for games is an active field of research with successful applications. However, how to generate content that embodies design intent is still an open research question. Level designers lack abstractions and tools for authoring generated artifacts for affecting emotion. We propose a novel pattern language for generative level design inspired by Appraisal Theory. Its patterns enable designers to add meaning, depth, and cohesiveness to the resulting content, and modify artifacts to make the content more engaging. We illustrate how these patterns can be implemented in a generative grammar for level generation for an adventure game. Formative evaluation of generated level content demonstrates the feasibility of the approach and suggests points for further improvements. Future work could focus on other elements which seem important for affecting emotions, including pacing, perception, and expectation. ",
        "authors": "Rosa Corstjens, Anders Bouwer, Joris Dormans, Riemer van Rozen",
        "bibtex": "@inproceedings{corstjens2018wonderful,\n title={Wonderful Design: Applying Appraisal Theory to Procedural Level Generation},\nauthor={Rosa Corstjens and Anders Bouwer and Joris Dormans and Riemer van Rozen},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ir.cwi.nl/pub/28418/28418.pdf",
        "local_file": "papers/Wonderful Design: Applying Appraisal Theory to Procedural Level Generation.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_106.pdf",
        "title": "Wonderful Design: Applying Appraisal Theory to Procedural Level Generation",
        "year": "2018"
    },
    {
        "abstract": "Procedural content generation via Machine Learning (PCGML) is the umbrella term for approaches that generate content for games via machine learning. One of the benefits of PCGML is that, unlike search or grammar-based PCG, it does not require hand authoring of initial content or rules. Instead, PCGML relies on existing content and black box models, which can be difficult to tune or tweak without expert knowledge. This is especially problematic when a human designer needs to understand how to manipulate their data or models to achieve desired results. We present an approach to Explainable PCGML via Design Patterns in which the design patterns act as a vocabulary and mode of interaction between user and model. We demonstrate that our technique outperforms non-explainable versions of our system in interactions with five expert designers, four of whom lack any machine learning expertise.",
        "authors": "Matthew Guzdial, Joshua Reno, Jonathan Chen, Gillian Smith, Mark Riedl",
        "bibtex": "@inproceedings{guzdial2018explainable,\n title={Explainable PCGML via Game Design Patterns},\nauthor={Matthew Guzdial and Joshua Reno and Jonathan Chen and Gillian Smith and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://arxiv.org/pdf/1809.09419",
        "local_file": "papers/Explainable PCGML via Game Design Patterns.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_107.pdf",
        "title": "Explainable PCGML via Game Design Patterns",
        "year": "2018"
    },
    {
        "abstract": "Beatmania is a rhythm action game where players play the role of a DJ that performs music by pressing specific controller buttons to mix 'Keysounds' (audio samples) at the correct time, unlike other rhythm action games such as Dance Dance Revolution. It has an active amateur Chart (Game stage) creation community, though chart authoring is considered a difficult and time-consuming task. We present a deep neural network based process for automatically generating Beatmania charts for arbitrary pieces of music. Given a raw audio track of a song, we identify notes according to instrument, and use a neural network to classify each note as playable or non-playable. The final chart is produced by mapping playable notes to controls. We achieve an F1-score on the core task of Sample Selection that significantly beats LSTM baselines.",
        "authors": "Zhiyu Lin, Kyle Xiao Mark Riedl",
        "bibtex": "@inproceedings{lin2018generationmania,\n title={GenerationMania: Learning to Semantically Choreograph},\nauthor={Zhiyu Lin and Kyle Xiao Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/5224/5080/",
        "local_file": "papers/GenerationMania: Learning to Semantically Choreograph.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_111.pdf",
        "title": "GenerationMania: Learning to Semantically Choreograph",
        "year": "2018"
    },
    {
        "abstract": "Humans' eye movements convey a lot of information about their intentions, often unconsciously. Intelligent agents that cooperate with humans in various domains can benefit from interpreting this information. This paper contains a preliminary look at how eye tracking could be useful for agents that play the cooperative card game Hanabi with human players. We outline several situations in which an AI agent can utilize gaze information, and present an outlook on how we plan to integrate this with reimplementations of contemporary Hanabi agents.",
        "authors": "Eva Tallula Gottwald, Markus Eger Chris Martens",
        "bibtex": "@inproceedings{gottwald2018tracking,\n title={I See What You See: Integrating Eye Tracking into Hanabi Playing Agents},\nauthor={Eva Tallula Gottwald and Markus Eger Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ceur-ws.org/Vol-2282/EXAG_112.pdf",
        "local_file": "papers/I See What You See: Integrating Eye Tracking into Hanabi Playing Agents.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_114.pdf",
        "title": "I See What You See: Integrating Eye Tracking into Hanabi Playing Agents",
        "year": "2018"
    },
    {
        "abstract": "Games that involve solving puzzles or mysteries often suffer from low replayability once the solution is known. Procedural content generation has been used to aid with increasing variance in game play, leading to a higher replay value. However, games that feature information that must be obtained by the player present the additional challenge of tracking the player's knowledge and ensuring that it is possible for them to finish the game. In this paper we present a detective game with procedurally generated characters that pursue a range of goals, including one that commits a murder. The player's role is to solve the crime by collecting evidence from the actual game world as well as by interrogating the characters. Even though some of the characters might be inclined to hide evidence, our system guarantees that the player is always able to solve the murder case. To demonstrate the capabilities of our system we present a short example game that we have implemented using our techniques.",
        "authors": "Henry Mohr, Markus Eger, Chris Martens",
        "bibtex": "@inproceedings{mohr2018eliminating,\n title={Eliminating the Impossible: A Procedurally Generated Murder Mystery},\nauthor={Henry Mohr and Markus Eger and Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "http://ceur-ws.org/Vol-2282/EXAG_113.pdf",
        "local_file": "papers/Eliminating the Impossible: A Procedurally Generated Murder Mystery.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_113.pdf",
        "title": "Eliminating the Impossible: A Procedurally Generated Murder Mystery",
        "year": "2018"
    },
    {
        "abstract": "In many video games, a wide range of non-playable characters make up the worlds players inhabit. Such characters are often voiced by human actors and their accents can have an influence on their perceived moral inclination, level of trustworthiness, social class, level of education and ethnic background. We use deep learning to train a neural network to classify speech accents. Such a machine-learned tool would provide game developers with an ability to analyze accent distribution in their titles as well as possibly help screening voiceover actors applying for a role. To make the approach accessible we used a readily available off the shelf deep network and commodity GPU hardware. Preliminary results are promising with a 71% test accuracy achieved over two accents in a commercial video game.",
        "authors": "Sergio Poo Hernandez, Vadim Bulitko, Shelby Carleton, Astrid Ensslin, Tejasvi Goorimoorthee",
        "bibtex": "@inproceedings{hernandez2018accents,\n title={Deep Learning for Classification of Speech Accents in Video Games},\nauthor={Sergio Poo Hernandez and Vadim Bulitko and Shelby Carleton and Astrid Ensslin and Tejasvi Goorimoorthee},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "http://ceur-ws.org/Vol-2282/EXAG_114.pdf",
        "local_file": "papers/Deep Learning for Classification of Speech Accents in Video Games.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_114.pdf",
        "title": "Deep Learning for Classification of Speech Accents in Video Games",
        "year": "2018"
    },
    {
        "abstract": "Neural Style Transfer was first unveiled by (Gatys, Ecker, and Bethge 2015), and since then has produced fantastic results working with 2D images. One logical extension of this field would be to move from 2D images into 3D models, and be able to transfer a notion of 3D style from one model to another. Here, we provide steps towards both understanding what style transfer in a 3D setting would look like, as well as demonstrating our own attempts towards one possible implementation.",
        "authors": "Jo Mazeika, Jim Whitehead",
        "bibtex": "@inproceedings{mazeika2018style,\n title={Towards 3D Neural Style Transfer},\nauthor={Jo Mazeika and Jim Whitehead},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "http://ceur-ws.org/Vol-2282/EXAG_115.pdf",
        "local_file": "papers/Towards 3D Neural Style Transfer.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_115.pdf",
        "title": "Towards 3D Neural Style Transfer",
        "year": "2018"
    },
    {
        "abstract": "Game development costs are on the rise as players expect massive open-world games populated with richly interactive non-playable characters (NPC). Procedural content generation has the potential to reduce the development costs as well as make the content more player-specific. Recent work on evolving artificial intelligence for NPCs focused on combat between NPCs and the player. In this paper we propose to evolve an ecosystem of NPCs for a broader class of games. To allow players' actions and playstyles to inform the evolution, we propose to model actual players and create AI-controlled proxies to evolve NPCs against. The approach removes the time pressure from the evolution and allows for traditional quality assurance methods while keeping the evolution player-informed.",
        "authors": "Vadim Bulitko, Mac Walters, Matthew R. Brown",
        "bibtex": "@inproceedings{bulitko2018alife,\n title={Evolving NPC Behaviours in A-life with Player Proxies},\nauthor={Vadim Bulitko and Mac Walters and Matthew R. Brown},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ceur-ws.org/Vol-2282/EXAG_116.pdf",
        "local_file": "papers/Evolving NPC Behaviours in A-life with Player Proxies.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_116.pdf",
        "title": "Evolving NPC Behaviours in A-life with Player Proxies",
        "year": "2018"
    },
    {
        "abstract": "Many games feature collectible items that are manually placed by a designer. In this work, we developed an algorithm, inspired by desire paths, for automatically placing collectible coins in a platformer game. Desire paths are paths naturally formed where people walk, rather than those laid down artificially, and are often the shortest or easiest route between an origin and destination. Our algorithm uses player trajectories to find paths along which to place the coins for each level. We ran an experiment comparing path-based placement to other placement methods. Although we did not find a difference in total time spent playing or likelihood of finishing the game, our results suggest that path-based placement leads to players collecting more coins in less time than with designer or randomly placed coins. Further, we found that players played similarly when coins were either path-based or there were no coins, and similarly when coins were either placed by a designer or randomly.",
        "authors": "Anurag Sarkar, Riddhi Padte, Jeffrey Cao, Seth Cooper",
        "bibtex": "@inproceedings{sarkar2018desire,\n title={Desire Path-Inspired Procedural Placement of Coins in a Platformer Game},\nauthor={Anurag Sarkar and Riddhi Padte and Jeffrey Cao and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://riffsircar.github.io/assets/pdfs/sarkar2018desire.pdf",
        "local_file": "papers/Desire Path-Inspired Procedural Placement of Coins in a Platformer Game.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_117.pdf",
        "title": "Desire Path-Inspired Procedural Placement of Coins in a Platformer Game",
        "year": "2018"
    },
    {
        "abstract": "Dread (Barmore et al. 2005) is an award-winning tabletop horror RPG that emphasizes storytelling. One of its innovative mechanics is the use of a questionnaire for character design that helps players develop a personality and history for their characters. Questionnaires vary for different scenarios and characters, but always include 'intrusive' questions such as 'why are you married if you aren't in love?' or 'what's the worst thing you've ever done to a loved one?' In this paper, we discuss work in progress on AutoDread, an implementation of Dread-style questionnaires for video games. The system presents human-authored questions and candidate answers to players to choose between, collecting the implications of those answers in a character model. As implications are accumulated, the system uses a SAT solver to filter questions and answers that are inconsistent with character facts established by previous questions. ",
        "authors": "Ian Horswill, Ethan Robison",
        "bibtex": "@inproceedings{horswill2018dread,\n title={What's the Worst Thing You've Ever Done at a Conference? Operationalizing Dread's Questionnaire Mechanic},\nauthor={Ian Horswill and Ethan Robison},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "http://ceur-ws.org/Vol-2282/EXAG_118.pdf",
        "local_file": "papers/What's the Worst Thing You've Ever Done at a Conference? Operationalizing Dread's Questionnaire Mechanic.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_118.pdf",
        "title": "What's the Worst Thing You've Ever Done at a Conference? Operationalizing Dread's Questionnaire Mechanic",
        "year": "2018"
    },
    {
        "abstract": "In recent years, the use of machine learning for procedural content generation (PCGML) has been growing. These PCGML approaches require a training corpus of levels, often annotated or represented in some abstracted way. Due to the manual effort required to annotate or translate a sufficient training corpus, most PCGML techniques have only been explored in a handful of domains. In this paper we take a step towards addressing this core issue of PCGML by presenting an unsupervised method for automatically extracting a representation for a level domain, given only images of the levels. This approach is a move towards making PCGML more broadly applicable by reducing the effort required to create a training corpus. We evaluate our approach by comparing the automatically extracted tile representation against existing PCGML training level corpus representations.",
        "authors": "Sam Snodgrass",
        "bibtex": "@inproceedings{snodgrass2018extraction,\n title={Towards Automatic Extraction of Tile Types from Level Images},\nauthor={Sam Snodgrass},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "http://ceur-ws.org/Vol-2282/EXAG_119.pdf",
        "local_file": "papers/Towards Automatic Extraction of Tile Types from Level Images.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_119.pdf",
        "title": "Towards Automatic Extraction of Tile Types from Level Images",
        "year": "2018"
    },
    {
        "abstract": "We introduce the problem of generating Let's Play-style commentary of gameplay video via machine learning. We propose an analysis of Let's Play commentary and a framework for building such a system. To test this framework we build an initial, naive implementation, which we use to interrogate the assumptions of the framework. We demonstrate promising results towards future Let's Play commentary generation.",
        "authors": "Matthew Guzdial, Shukan Shah, Mark Riedl",
        "bibtex": "@inproceedings{guzdial2018letsplay,\n title={Towards Automated Let's Play Commentary},\nauthor={Matthew Guzdial and Shukan Shah and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://arxiv.org/pdf/1809.09424",
        "local_file": "papers/Towards Automated Let's Play Commentary.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_120.pdf",
        "title": "Towards Automated Let's Play Commentary",
        "year": "2018"
    },
    {
        "abstract": "Expert-crafted puzzle games are notable for their ability to wordlessly teach players deep and interesting consequences of mechanics. Cognitive science theories suggest that this learning happens through an iterative process of hypothesizing, failure, and revision of mental models. In this work, we pose the question of what it would take to generate puzzle game levels and progressions that best support player satisfaction and systematic understanding of mechanics by integrating an understanding of player mental models. We present a preliminary investigation consisting of a new puzzle game Laserverse, whose mechanics are designed to interact with each other in a wide array of combinations, a set of hand-authored levels that combine these mechanics hierarchically, and an algorithm for organizing the levels into progressions to test hypotheses based on a theory of mental model formation. This work sets the stage for empirical validation of puzzle game design principles, which in turn inform a new approach to player modeling based on mental model matching theory.",
        "authors": "Chris Martens, Aaron Williams, Ryan S. Alexander, Chinmaya Dabral",
        "bibtex": "@inproceedings{martens2018puzzle,\n title={Generating Puzzle Progressions to Study Mental Model Matching},\nauthor={Chris Martens and Aaron Williams and Ryan S. Alexander and Chinmaya Dabral},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "",
        "local_file": "",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_121.pdf",
        "title": "Generating Puzzle Progressions to Study Mental Model Matching",
        "year": "2018"
    },
    {
        "abstract": "Many computer games feature non-player character (NPC) teammates and companions; however, playing with or against NPCs can be frustrating when they perform unexpectedly. These frustrations can be avoided if the NPC has the ability to explain its actions and motivations. When NPC behavior is controlled by a black box AI system it can be hard to generate the necessary explanations. In this paper, we present a system that generates human-like, natural language explanations-called rationales-of an agent's actions in a game environment regardless of how the decisions are made by a black box AI. We outline a robust data collection and neural network training pipeline that can be used to gather think-aloud data and train a rationale generation model for any similar sequential turn based decision making task. A human-subject study shows that our technique produces believable rationales for an agent playing the game, Frogger. We conclude with insights about how people perceive automatically generated rationales.",
        "authors": "Upol Ehsan, Pradyumna Tambwekar, Larry Chan, Brent Harrison, Mark O. Riedl",
        "bibtex": "@inproceedings{ehsan2018rationales,\n title={Learning to Generate Natural Language Rationales for Game Playing Agents},\nauthor={Upol Ehsan and Pradyumna Tambwekar and Larry Chan and Brent Harrison and Mark O. Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://uknowledge.uky.edu/cgi/viewcontent.cgi?article=1017&context=cs_facpub",
        "local_file": "papers/Learning to Generate Natural Language Rationales for Game Playing Agents.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_122.pdf",
        "title": "Learning to Generate Natural Language Rationales for Game Playing Agents",
        "year": "2018"
    },
    {
        "abstract": "A number of recent models for empirically-grounded social simulation  have  emerged  recently  from  games  and  interactive  narrative  research,  generally  exploring  models  of  trust, emotion, and social graph changes that occur in the process of inter-character interactions. However, these models so far failed to provide realistic models of opinion change and predisposition to new knowledge. Equipped with such a notion, these emergent social simulations can express both real and fictionalized  depictions  of  modern  phenomena  like  adverse media influence, the spread of 'fake news,' and the polarization of ideological sects. We present a preliminary computational investigation into modeling  opinion change in virtual characters with this goal in mind.",
        "authors": "Sasha Azad, Chris Martens",
        "bibtex": "@inproceedings{azad2018opinionated,\n title={Addressing the Elephant in the Room: Opinionated Virtual Characters},\nauthor={Sasha Azad and Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://www.researchgate.net/profile/Sasha-Azad/publication/331024627_Addressing_the_Elephant_in_the_Room_Opinionated_Virtual_Characters/links/5c61da7da6fdccb608bba207/Addressing-the-Elephant-in-the-Room-Opinionated-Virtual-Characters.pdf",
        "local_file": "papers/Addressing the Elephant in the Room: Opinionated Virtual Characters.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_123.pdf",
        "title": "Addressing the Elephant in the Room: Opinionated Virtual Characters",
        "year": "2018"
    },
    {
        "abstract": "Generative methods provide rich, emergent ways to deal with many kinds of data. In this paper, we explore projects that listen to human motion, and respond through emergent generative art in ways that are inspired by dance and puppetry.",
        "authors": "Kate Compton, Michael Mateas",
        "bibtex": "@inproceedings{compton2018freedom,\n title={Freedom of Movement: Generative Responses to Motion Control},\nauthor={Kate Compton and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://ceur-ws.org/Vol-2282/EXAG_124.pdf",
        "local_file": "papers/Freedom of Movement: Generative Responses to Motion Control.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_124.pdf",
        "title": "Freedom of Movement: Generative Responses to Motion Control",
        "year": "2018"
    },
    {
        "abstract": "Recent work has shown machine learning approaches to be effective in training models on existing game data for informing procedural generation of novel content. Specifically, ML techniques have successfully used existing game levels to train models for generating new levels and blending existing ones. Such blending of not just levels, but entire games, has also been proposed as a possible means of generating new games. In this paper, we build on these works by training Long Short Term Memory recurrent neural networks on level data for two separate platformer games-Super Mario Bros. and Kid Icarus-and use these models to create new levels that are blends of levels from both games, thus creating a level generator for a novel, third game.",
        "authors": "Anurag Sarkar, Seth Cooper",
        "bibtex": "@inproceedings{sarkar2018blending,\n title={Blending Levels from Different Games using LSTMs},\nauthor={Anurag Sarkar and Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://riffsircar.github.io/assets/pdfs/sarkar2018blending.pdf",
        "local_file": "papers/Blending Levels from Different Games using LSTMs.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_125.pdf",
        "title": "Blending Levels from Different Games using LSTMs",
        "year": "2018"
    },
    {
        "abstract": "Procedural Level Generation via Machine Learning (PLGML), the study of generating game levels with machine learning, has received a large amount of recent academic attention. For certain measures these approaches have shown success at replicating the quality of existing game levels. However, it is unclear the extent to which they might benefit human designers. In this paper we present a framework for co-creative level design with a PLGML agent. In support of this framework we present results from a user study and results from a comparative study of PLGML approaches.",
        "authors": "Matthew Guzdial, Nicholas Liao, Mark Riedl",
        "bibtex": "@inproceedings{guzdial2018cocreative,\n title={Co-Creative Level Design via Machine Learning},\nauthor={Matthew Guzdial and Nicholas Liao and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2018}}",
        "link": "https://arxiv.org/pdf/1809.09420",
        "local_file": "papers/Co-Creative Level Design via Machine Learning.pdf",
        "old_url": "http://ceur-ws.org/Vol-2282/EXAG_126.pdf",
        "title": "Co-Creative Level Design via Machine Learning",
        "year": "2018"
    },
    {
        "abstract": "Chairs' Note: In this invited industry case study, Tarn Adams discusses recent extensions to Dwarf Fortress's systems for character deception. A noted opus in the history of videogames, Dwarf Fortress is a roguelike set in procedurally generated fantasy universes. It has been shown at the Museum of Modern Art and has been featured in The New York Times, The New Yorker, Wired, and many other press publications. Currently, Tarn and his brother, Zach Adams, are roughly midway through its famous 30-year development cycle. As Tarn explains in this paper, an upcoming update centered around artifacts-and what characters know about them-has had the fun consequence of necessitating that a certain class of non-player characters cultivate secret identities. This major extension has brought both technical and design challenges, as this paper illustrates. -James Ryan",
        "authors": "Tarn Adams",
        "bibtex": "@inproceedings{adams2017secret,\n title={Secret Identities in Dwarf Fortress},\nauthor={Tarn Adams},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12963/12811",
        "local_file": "papers/Secret Identities in Dwarf Fortress.pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15822",
        "title": "Secret Identities in Dwarf Fortress",
        "year": "2017"
    },
    {
        "abstract": "Procedurally generating rich, naturally behaving AI-controlled video game characters is an important open problem. In this paper we focus on a particular aspect of non-playable character (NPC) behavior, long favored by science-fiction writers. Specifically, we study the effects of self-knowledge on NPC behavior. To do so we adopt the well-known framework of agent-centered real-time heuristic search applied to the standard pathfinding task on video-game maps. Such search agents normally use a heuristic function to guide them around a map to the goal state. Heuristic functions are inaccurate underestimates of the remaining distance to goal. What if the agent somehow knew how long it (the agent) would actually take to reach the goal from each state? How would using such self-knowledge in place of a heuristic function affect the agent's behavior? We show that similarly to real life, knowing of one's irrational behavior in a situation can deter the agent from getting into that situation again even if it is, in fact, a part of an optimal solution. We demonstrate the \"fear\" with a simple example and empirically show that the issue is common in video-game pathfinding. We then analyze the issue theoretically and suggest that \"fear\" induced by self-knowledge is not a bug but a feature and may potentially be used to develop more naturally behaving NPCs.",
        "authors": "Vadim Bulitko",
        "bibtex": "@inproceedings{bulitko2017effects,\n title={Effects of Self-Knowledge: Once Bitten Twice Shy },\nauthor={Vadim Bulitko},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12969/12817",
        "local_file": "papers/Effects of Self-Knowledge: Once Bitten Twice Shy .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15874",
        "title": "Effects of Self-Knowledge: Once Bitten Twice Shy ",
        "year": "2017"
    },
    {
        "abstract": "Video games often populate their in-game world with numerous ambient non-playable characters. Manually crafting interesting behaviors for such characters can be prohibitively expensive. As scripted AI gets re-used across multiple characters, they can appear overly similar, shallow and generally uninteresting for the player to interact with. In this paper we propose to evolve interesting behaviors in a simulated evolutionary environment. Since only some evolution runs may give rise to such behaviors, we propose to train deep neural networks to detect such behaviors. The paper presents work in progress in this direction.",
        "authors": "Vadim Bulitko, Shelby Carleton, Delia Cormier, Devon Sigurdson, John Simpson",
        "bibtex": "@inproceedings{simpson2017surprising,\n title={Towards Positively Surprising Non-Player Characters in Video Games },\nauthor={Vadim Bulitko and Shelby Carleton and Delia Cormier and Devon Sigurdson and John Simpson},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12981/12829",
        "local_file": "papers/Towards Positively Surprising Non-Player Characters in Video Games .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15912",
        "title": "Towards Positively Surprising Non-Player Characters in Video Games ",
        "year": "2017"
    },
    {
        "abstract": "Several frameworks exist to describe how procedural content can be understood, or how it can be used in games. In this paper, we present a framework that considers generativity as a pipeline of successive data transformations, with each transformation either generating, transforming, or pruning away information. This framework has been iterated through repeated engagement and education interactions with the game development and generative art communities. In its most recent refinement, it has been physically instantiated into a deck of cards, which can be used to analyze existing examples of generativity or design new generative systems. This Generative Framework of Generativity aims to constructively define the design space of generative pipelines.",
        "authors": "Kate Compton, Michael Mateas",
        "bibtex": "@inproceedings{compton2017generativity,\n title={A Generative Framework of Generativity },\nauthor={Kate Compton and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12974/12822",
        "local_file": "papers/A Generative Framework of Generativity .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15896",
        "title": "A Generative Framework of Generativity ",
        "year": "2017"
    },
    {
        "abstract": "We present Generominos, a set of design cards to model inter- active generative systems. While many ideation cards exist, Generominos attempts to model the constraints of making a transformative pipeline of data in the constraints of the cards themselves. For this paper, we contribute the design of the Generominos cards and a preliminary evaluation of perceived usefulness in an undergraduate alternative controller class.",
        "authors": "Kate Compton, Edward Melcer, Michael Mateas",
        "bibtex": "@inproceedings{compton2017generonimos,\n title={Generominos: Ideation Cards for Interactive Generativity },\nauthor={Kate Compton and Edward Melcer and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12975/12823",
        "local_file": "papers/Generominos: Ideation Cards for Interactive Generativity .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15898",
        "title": "Generominos: Ideation Cards for Interactive Generativity ",
        "year": "2017"
    },
    {
        "abstract": "ANGELINA is an automated game design system which has previously been built as a single software block which designs games from start to finish. In this paper we outline a roadmap for the development of a new version of ANGELINA, designed to iterate on games in different ways to produce a continuous creative process that will improve the quality of its work, but more importantly improve the perception of the software as being an independently creative piece of software. We provide an initial report of the system's structure here as well as results from the first working module of the system.",
        "authors": "Michael Cook",
        "bibtex": "@inproceedings{cook2017design,\n title={A Vision for Continuous Automated Game Design },\nauthor={Michael Cook},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12967/12815",
        "local_file": "papers/A Vision for Continuous Automated Game Design .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15850",
        "title": "A Vision for Continuous Automated Game Design ",
        "year": "2017"
    },
    {
        "abstract": "We argue that social simulation can help us understand social justice issues. In particular, modeling certain social dynamics within computational systems can be used to creatively explore and better understand the social and identity dynamics of oppression. Writing theories of oppression in code forces us to explicate everything, and question what we leave out or what we can't account for. As an early step in this direction, we present an in-progress social simulation of group discussion in activist meetings, developed in the already-existing AI system, Ensemble. Through this minimal, highly constrained social arena, we can explore wide-reaching phenomena like privilege, intersectionality, and power dynamics in nonhierarchical groups, but in a way that's grounded in concrete, person-to-person interactions. We propose that this kind of social simulation can aid in the process of unlearning hegemonic ways of being, and imagining liberatory alternatives.",
        "authors": "Melanie Leah Dickinson, Noah Wardrip-Fruin, Michael Mateas",
        "bibtex": "@inproceedings{dickinson2017social,\n title={Social Simulation for Social Justice },\nauthor={Melanie Leah Dickinson and Noah Wardrip-Fruin and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12982/12830",
        "local_file": "papers/Social Simulation for Social Justice .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15917",
        "title": "Social Simulation for Social Justice ",
        "year": "2017"
    },
    {
        "abstract": "In video games, a wide range of characters make up the world players inhabit. These characters, NPCs, have traits, such as their appearance and speech accent, that determine certain things about them, including moral inclination, levels of trustworthiness, social class, levels of education, and ethnic background. But what does an accent say about a character in a video game? We use deep learning to train a neural network to detect speech accents and establish the degree to which machines can be used to recognize these accents. This research aims to help sociolinguists and discourse analysts establish critical study and content analytical findings for instance about stereotypical uses of speech accents, to better analyze who has what accent in video games, and what kind of language ideologies and social value judgments the use of accents in games construct and perpetuate. This paper presents the results of the first deep learning experiments, which were conducted on Standard North American, British Received Pronunciation, and Spanish English. We discuss our methodological considerations and some early deep learning results, which show relatively low levels of accuracy (61%). We discuss possibilities of improving our method, and of enriching our training datasets.",
        "authors": "Astrid Ensslin, Tejasvi Goorimoorthee, Shelby Carleton, Vadim Bulitko, Sergio Poo Hernandez",
        "bibtex": "@inproceedings{ensslin2017deep,\n title={Deep Learning for Speech Accent Detection in Videogames },\nauthor={Astrid Ensslin and Tejasvi Goorimoorthee and Shelby Carleton and Vadim Bulitko and Sergio Poo Hernandez},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12968/12816",
        "local_file": "papers/Deep Learning for Speech Accent Detection in Videogames .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15861",
        "title": "Deep Learning for Speech Accent Detection in Videogames ",
        "year": "2017"
    },
    {
        "abstract": "We propose the problem of tutorial generation for games, i.e. to generate tutorials which can teach players to play games, as an AI problem. This problem can be approached in several ways, including generating natural language descriptions of game rules, generating instructive game levels, and generating demonstrations of how to play a game using agents that play in a human-like manner. We further argue that the General Video Game AI framework provides a useful testbed for addressing this problem.",
        "authors": "Michael Cerny Green, Ahmed Khalifa, Gabriella A. B. Barros, Julian Togellius",
        "bibtex": "@inproceedings{green2017tutorial,\n title={Press Space to Fire: Automatic Video Game Tutorial Generation },\nauthor={Michael Cerny Green and Ahmed Khalifa and Gabriella A. B. Barros and Julian Togellius},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12977/12825",
        "local_file": "papers/Press Space to Fire: Automatic Video Game Tutorial Generation .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15903",
        "title": "Press Space to Fire: Automatic Video Game Tutorial Generation ",
        "year": "2017"
    },
    {
        "abstract": "In this paper we describe a level design editor designed as an interface to allow different AI agents to creatively collaborate on level design problems with human designers. We intend to investigate the comparative impacts of different AI techniques on user experience in this context.",
        "authors": "Matthew James Guzdial, Jonathan Chen, Shao-Yu Chen, Mark Riedl",
        "bibtex": "@inproceedings{guzdial2017general,\n title={A General Level Design Editor for Co-Creative Level Design },\nauthor={Matthew James Guzdial and Jonathan Chen and Shao-Yu Chen and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12980/12828",
        "local_file": "papers/A General Level Design Editor for Co-Creative Level Design .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15907",
        "title": "A General Level Design Editor for Co-Creative Level Design ",
        "year": "2017"
    },
    {
        "abstract": "Marahel is a language and framework for constructive generation of 2D tile-based game levels. It is developed with the dual aim of making it easier to build level generators for game developers, and to help solving the general level generation problem by creating a generator space that can be searched using evolution. We describe the different sections of the level generators, and show examples of generated maps from 5 dif- ferent generators. We analyze their expressive range on three dimensions: percentage of empty space, number of isolated elements, and cell-wise entropy of empty space. The results show that generators that have starkly different output from each other can easily be defined in Marahel.",
        "authors": "Ahmed Khalifa, Julian Togelius",
        "bibtex": "@inproceedings{khalifa2017marahel,\n title={Marahel: A Language for Constructive Level Generation },\nauthor={Ahmed Khalifa and Julian Togelius},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12970/12818",
        "local_file": "papers/Marahel: A Language for Constructive Level Generation .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15878",
        "title": "Marahel: A Language for Constructive Level Generation ",
        "year": "2017"
    },
    {
        "abstract": "General videogame playing has come a long way in a short period of time, but remains at the level of solving relatively short games made up of distinct and isolated episodes. Even simple console role-playing games (RPGs) are far beyond the reach of current techniques, requiring the synthesis of cultural knowledge with compositional reasoning over several interconnected sub-games. We explore how the challenges of playing these games could spark new advances in compositional analysis of games and common-sense reasoning. General RPG playing can leverage advances in episodic general game playing and in areas like text understanding, image classification, and automated game design learning. It has direct applications in design support and AI-based game design, and the techniques used to enable it could generalize to other families of games such as adventure, open-world, and simulation games. In this paper, we describe the motivation behind general RPG playing in a sub-domain of Nintendo Entertainment System (NES) RPGs, some promising approaches to some of its fundamental issues, and immediate next steps; we conclude by describing a few concrete benchmark problems on the path towards automated play of these complex games.",
        "authors": "Joseph C. Osborn, Ben Samuel, Adam Summerville, Michael Mateas",
        "bibtex": "@inproceedings{osborn2017rpg,\n title={Towards General RPG Playing },\nauthor={Joseph C. Osborn and Ben Samuel and Adam Summerville and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12976/12824",
        "local_file": "papers/Towards General RPG Playing .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15899",
        "title": "Towards General RPG Playing ",
        "year": "2017"
    },
    {
        "abstract": "A procedure that uses phonetic transcriptions of words to produce a continuous vector-space model of phonetic sound similarity is presented. The vector dimensions of words in the model are calculated using interleaved phonetic feature bigrams, a novel method that captures similarities in sound that are difficult to model with orthographic or phonemic information alone. Measurements of similarity between items in the resulting vector space are shown to perform well on established tests for predicting phonetic similarity. Additionally, a number of applications of vector arithmetic and nearest-neighbor search are presented, demonstrating potential uses of the vector space in experimental poetry and procedural content generation.",
        "authors": "Allison Parrish",
        "bibtex": "@inproceedings{parrish2017poetic,\n title={Poetic Sound Similarity Vectors Using Phonetic Features },\nauthor={Allison Parrish},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12971/12819",
        "local_file": "papers/Poetic Sound Similarity Vectors Using Phonetic Features .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15879",
        "title": "Poetic Sound Similarity Vectors Using Phonetic Features ",
        "year": "2017"
    },
    {
        "abstract": "We present a system for quickly prototyping AI code for modeling social interaction among the simulated residents of a skyscraper. The system is built on top of a commercially released indie game but replaces its character AI with a general-purpose logic programming language. These two features together simplify the more tedious parts of creating prototype AI code from scratch, enabling more effort to be focused on the meatier parts of research.",
        "authors": "Ethan Christopher Robison",
        "bibtex": "@inproceedings{robison2017sandbox,\n title={A Sandbox for Modeling Social AI },\nauthor={Ethan Christopher Robison},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12979/12827",
        "local_file": "papers/A Sandbox for Modeling Social AI .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15905",
        "title": "A Sandbox for Modeling Social AI ",
        "year": "2017"
    },
    {
        "abstract": "In this invited industry case study, Tanya X.Short introduces eight mechanisms that designers can utilize to better harness procedural character personalities in games. Tanya is co-founder and captain of Kitfox Games, a Montreal-based independent game studio, and a veteran developer and designer known for her expertise in procedural generation and systems-driven game design. With Tarn Adams, she edited the 2017 volume Procedural Generation in Game Design. As Tanya explains in this paper, there is an emerging pattern in game design that utilizes character personality as a central gameplay system. Using a number of examples spanning her experiences as both developer and player, in this paper Tanya distills her collected design knowledgeinto an actionable recipe for building better character personality systems.",
        "authors": "Tanya X. Short",
        "bibtex": "@inproceedings{short2017personalities,\n title={Designing Stronger AI Personalities },\nauthor={Tanya X. Short},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12973/12821",
        "local_file": "papers/Designing Stronger AI Personalities .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15889",
        "title": "Designing Stronger AI Personalities ",
        "year": "2017"
    },
    {
        "abstract": "Proofdoku is an AI-based game design that extends Sudoku. In addition to playing by the rules of the traditional logic puzzle, players must explain their reasoning. An AI system checks this reasoning and provides hints that guide the player to discover new reasoning patterns for themselves. Co-developing the game design and the AI system, implemented using the technology of Answer Set Programming (ASP), guided us to include features that depend on high-complexity combinatorial search and optimization. We developed Proofdoku to better understand the implications of designing and deploying game systems that depend on ASP for live interaction. This paper offers design tradeoffs and makes suggestions for future deployments of ASP-backed game designs.",
        "authors": "Adam M. Smith",
        "bibtex": "@inproceedings{smith2017proofdoku,\n title={Answer Set Programming in Proofdoku },\nauthor={Adam M. Smith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12972/12820",
        "local_file": "papers/Answer Set Programming in Proofdoku .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15885",
        "title": "Answer Set Programming in Proofdoku ",
        "year": "2017"
    },
    {
        "abstract": "Procedural content generation via machine learning (PCGML) has been growing in recent years. However, many PCGML approaches are only explored in the context of linear platforming games, and focused on modeling structural level information. Previously, we developed a multi-layer level representation, where each layer is designed to capture specific level information. In this paper, we apply our multi-layer approach to Lode Runner, a game with non-linear paths and complex actions. We test our approach by generating levels for Lode Runner with a constrained multi-dimensional Markov chain (MdMC) approach that ensures playability and a standard MdMC sampling approach. We compare the levels sampled when using multi-layer representation against those sampled using the single-layer representation; we compare using both the constrained sampling algorithm and the standard sampling algorithm.",
        "authors": "Sam Snodgrass, Santiago Ontanon",
        "bibtex": "@inproceedings{snodgrass2017generation,\n title={Leveraging Multi-Layer Level Representations for Puzzle-Platformer Level Generation },\nauthor={Sam Snodgrass and Santiago Ontanon},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12966/12814",
        "local_file": "papers/Leveraging Multi-Layer Level Representations for Puzzle-Platformer Level Generation .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15846",
        "title": "Leveraging Multi-Layer Level Representations for Puzzle-Platformer Level Generation ",
        "year": "2017"
    },
    {
        "abstract": "A challenge of game design is in providing affordances to players so that they can learn and improve their skills. Advances in Procedural Content Generation (PCG) suggest this type of game content is a candidate for automatic creation. Some work in PCG has been successful in customizing game difficulty to achieve desired player experience; however, this often involves bringing the difficulty of the game to a level appropriate for the player's current skills. Players desiring to improve their performance in a particular game may be willing to tolerate relatively higher levels of frustration and anx- iety than are targeted in experience-based approaches. As an initial step in this line of inquiry, we introduce ProcDefense, an action game with a modular difficulty control interface, as a platform for future inquiry into the effectiveness of differing PCG techniques for performance-training, dynamic difficulty adjustment.",
        "authors": "Brandon R. Thorne, Hiru Nelakkutti, Joseph Reinhart, Arnav Jhala",
        "bibtex": "@inproceedings{thorne2017procdefense,\n title={ProcDefense - A Game Framework for Procedural Player Skill Training },\nauthor={Brandon R. Thorne and Hiru Nelakkutti and Joseph Reinhart and Arnav Jhala},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12978/12826",
        "local_file": "papers/ProcDefense - A Game Framework for Procedural Player Skill Training .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15904",
        "title": "ProcDefense - A Game Framework for Procedural Player Skill Training ",
        "year": "2017"
    },
    {
        "abstract": "Dynamic Epistemic Logics are a set of multimodal logics that deal with knowledge and change. We argue that the theory for this formalism is mature enough to start a practical implementation, while at the same time having a sizable amount of theoretical expansions. We also claim that these two factors make it an attractive formalism for new features in games featuring an agent's internal model, like planning for gathering information, acting without revealing one's goals or feeding possibly false information to a set of agents to influence their beliefs, augmenting already existing mechanisms.",
        "authors": "Javier M. Torres",
        "bibtex": "@inproceedings{torres2017dynamic,\n title={Dynamic Epistemic Logic in Game Design },\nauthor={Javier M. Torres},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12965/12813",
        "local_file": "papers/Dynamic Epistemic Logic in Game Design .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15839",
        "title": "Dynamic Epistemic Logic in Game Design ",
        "year": "2017"
    },
    {
        "abstract": "Games have used different mechanisms along its history to provide agent behavior: FSMs, utility systems, behavior trees and planning methods. In this paper, we present an architecture that aims at incorporating all these approaches into trees of event handling nodes with behaviours as leaves, using rules for combining actions akin to utility systems. This formalism aims to develop hybrid systems in an easier way.",
        "authors": "Javier M. Torres",
        "bibtex": "@inproceedings{torres2017unified,\n title={A Proposal for a Unified Agent Behaviour Framework },\nauthor={Javier M. Torres},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2017}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12964/12812",
        "local_file": "papers/A Proposal for a Unified Agent Behaviour Framework .pdf",
        "old_url": "https://aaai.org/ocs/index.php/AIIDE/AIIDE17/paper/view/15838",
        "title": "A Proposal for a Unified Agent Behaviour Framework ",
        "year": "2017"
    },
    {
        "abstract": "The use of artificial intelligence and procedural content generation algorithms in mixed reality games is an unexplored space. We posit that these algorithms can enhance the gameplay experience in mixed reality games. We present two prototype games that use procedural content generation to design levels that make use of the affordances in the player's physical environment. The levels produced can be tailored to a user, customizing gameplay difficulty and affecting how the player moves around the real-world environment.",
        "authors": "Sasha Azad, Carl Saldanha, Cheng-Hann Gan, Mark O. Riedl",
        "bibtex": "@inproceedings{azad2016mixed,\n title={Mixed Reality Meets Procedural Content Generation in Video Games},\nauthor={Sasha Azad and Carl Saldanha and Cheng-Hann Gan and Mark O. Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12898/12746",
        "local_file": "papers/Mixed Reality Meets Procedural Content Generation in Video Games.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14073",
        "title": "Mixed Reality Meets Procedural Content Generation in Video Games",
        "year": "2016"
    },
    {
        "abstract": "This paper describes an avenue for artificial and computational intelligence techniques applied within games research to be deployed for purposes of physical therapy. We provide an overview of prototypical research focussed on the application of motion sensor input devices and virtual reality equipment for rehabilitation of motor impairment: an issue typical of patients of traumatic brain injuries. We highlight how advances in procedural content generation and player modelling can stimulate development in this area by improving quality of rehabilitation programmes and measuring patient performance.",
        "authors": "Shabnam Sadeghi Esfahlani, Tommy Thompson",
        "bibtex": "@inproceedings{esfahlani2016physiotherapy,\n title={Intelligent Physiotherapy Through Procedural Content Generation},\nauthor={Shabnam Sadeghi Esfahlani and Tommy Thompson},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12890/12738",
        "local_file": "papers/Intelligent Physiotherapy Through Procedural Content Generation.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14055",
        "title": "Intelligent Physiotherapy Through Procedural Content Generation",
        "year": "2016"
    },
    {
        "abstract": "Automatic analysis of game levels can provide as- sistance to game designers and procedural content generation. We introduce a static-dynamic scale to categorize level analysis strategies, which captures the extent that the analysis depends on player simulation. Due to its ability to automatically learn intermediate representations for the task, a convolutional neural network (CNN) provides a general tool for both types of analysis. In this paper, we explore the use of CNN to analyze 1,437 Infinite Mario levels. We further propose a deep reinforcement learning technique for dynamic analysis, which allows the simulated player to pay a penalty to reduce error in its control. We empirically demonstrate the effectiveness of our techniques and complementarity of dynamic and static analysis.",
        "authors": "Matthew James Guzdial, Nathan Sturtevant, Boyang Li",
        "bibtex": "@inproceedings{guzdial2016dynamic,\n title={Deep Static and Dynamic Level Analysis: A Study on Infinite Mario},\nauthor={Matthew James Guzdial and Nathan Sturtevant and Boyang Li},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12894/12742",
        "local_file": "papers/Deep Static and Dynamic Level Analysis: A Study on Infinite Mario.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14068",
        "title": "Deep Static and Dynamic Level Analysis: A Study on Infinite Mario",
        "year": "2016"
    },
    {
        "abstract": "Players in Dear Leader's Happy Story Time are placed in the role of contestants in a reality TV show where they are forced to audition for roles in the upcoming film of the host, a deranged billionaire who has inexplicably been elected president. The stories are produced by a story generator that combines stock plots and characters to produce kitsch story outlines. The players then collaborate to improvise a camp performance of the outline. The game design provides a context for experimenting with automatic story generation within a narrative game, as well as an opportunity for experimenting with knowledge representation schemes for expressing the tropes of popular narrative. The story generator uses a higher-order logic for describing tropes, and an HTN planning algorithm based on Nau et al.'s SHOP.",
        "authors": "Ian D. Horswill",
        "bibtex": "@inproceedings{horswill2016dear,\n title={Dear Leader's Happy Story Time: A Party Game Based on Automated Story Generation},\nauthor={Ian D. Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12902/12750",
        "local_file": "papers/Dear Leader's Happy Story Time: A Party Game Based on Automated Story Generation.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14083",
        "title": "Dear Leader's Happy Story Time: A Party Game Based on Automated Story Generation",
        "year": "2016"
    },
    {
        "abstract": "We describe an application of neural networks to predict the placements of resources in StarCraft II maps. Networks are trained on existing maps taken from databases of maps actively used in online competitions and tested on unseen maps with resources (minerals and vespene gas) removed. This method is potentially useful for AI-assisted game design tools, allowing the suggestion of resource and base placements consonant with implicit StarCraft II design principles for fully or partially sketched heightmaps. By varying the thresholds for the placement of resources, more or fewer resources can be created consistently with the pattern of a single map. We further propose that these networks can be used to help understand the design principles of StarCraft II maps, and by extension other, similar types of game content.",
        "authors": "Scott Lee, Aaron Isaksen, Christoffer Holmgard, Julian Togelius",
        "bibtex": "@inproceedings{lee2016resource,\n title={Predicting Resource Locations in Game Maps Using Deep Convolutional Neural Networks},\nauthor={Scott Lee and Aaron Isaksen and Christoffer Holmgard and Julian Togelius},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12893/12741",
        "local_file": "papers/Predicting Resource Locations in Game Maps Using Deep Convolutional Neural Networks.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14062",
        "title": "Predicting Resource Locations in Game Maps Using Deep Convolutional Neural Networks",
        "year": "2016"
    },
    {
        "abstract": "While generative approaches to game design offer great promise, systems can only reliably generate what they can 'understand,' often limited to what can be handencoded by system authors. Proceduralist readings, a way of deriving meaning for games based on their underlying processes and interactions in conjunction with aesthetic and cultural cues, offer a novel, systematic approach to game understanding. We formalize proceduralist argumentation as a logic program that performs static reasoning over game specifications to derive higher-level meanings (e.g., deriving dynamics from mechanics), opening the door to broader and more culturally-situated game generation.",
        "authors": "Chris Martens, Adam Summerville, Michael Mateas, Joseph Osborn, Sarah Harmon, Noah Wardrip-Fruin, Arnav Jhala",
        "bibtex": "@inproceedings{martens2016proceduralist,\n title={Proceduralist Readings, Procedurally},\nauthor={Chris Martens and Adam Summerville and Michael Mateas and Joseph Osborn and Sarah Harmon and Noah Wardrip-Fruin and Arnav Jhala},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12892/12740",
        "local_file": "papers/Proceduralist Readings, Procedurally.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14061",
        "title": "Proceduralist Readings, Procedurally",
        "year": "2016"
    },
    {
        "abstract": "Platformer level generation has often used a beat metaphor to relate to how players interact with level geometry. However, this conceptualization of beats is different from the musical concept of `beat', limiting the utility of theories and tools developed in music analysis for platformer levels. A gameplay gestalt, a pattern of interaction that the player enacts or performs in order to make progress in a game, may fit the beat metaphor. By taking a very similar lens and viewing players playing platformer levels as enacting a series of gameplay gestalts through time, gestalt music analysis (GMA) does fit into the platformer domain. This paper details work on transforming a GMA model to work with the Platformer Experience Dataset (PED), and some promising first results of the transformed model.",
        "authors": "Johnathan Pagnutti",
        "bibtex": "@inproceedings{pagnutti2016bach,\n title={What Does Bach Have in Common with World 1-1: Automatic Platformer Gestalt Analysis},\nauthor={Johnathan Pagnutti},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12903/12751",
        "local_file": "papers/What Does Bach Have in Common with World 1-1: Automatic Platformer Gestalt Analysis.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14084",
        "title": "What Does Bach Have in Common with World 1-1: Automatic Platformer Gestalt Analysis",
        "year": "2016"
    },
    {
        "abstract": "Interactive narratives (IN) are stories that branch and change based on the actions of a participant. A class of automated systems generate INs where all story branches conform to a set of constraints predefined by an author. Participants in these systems may create invalid branches by navigating the story world outside the bounds of an author's constraints. We approach this problem from an adversarial game perspective, where the IN system's goal is to prevent the player from creating invalid branches. From this perspective, one way an IN system can take action is to transition the game world between alternate states that are consistent with the player's observations during gameplay. In this paper we present a method of modelling and updating sets of world states consistent with player knowledge as a single superposed data structure. We discuss how this data structure can be used in an IN framework to maximize the probability that author constraints are maintained during gameplay.",
        "authors": "Justus Robertson, R. Michael Young",
        "bibtex": "@inproceedings{robertson2016superposed,\n title={A Model of Superposed States},\nauthor={Justus Robertson and R. Michael Young},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=b5faf444879ad4f54150050aa64e6c02a229c5e7",
        "local_file": "papers/A Model of Superposed States.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14071",
        "title": "A Model of Superposed States",
        "year": "2016"
    },
    {
        "abstract": "We present Juke Joint, a small work of interactive storytelling that demonstrates an extension to the Talk of the Town framework by which characters form thoughts, expressed in natural language, that are elicited by environmental stimuli. Juke Joint takes place in a procedurally generated American small town, in a bar with a haunted jukebox and two patrons facing personal dilemmas; the player is a ghost whose only action is to select which song from the jukebox will play. As the lyrics of the song emanate from the machine, thoughts are elicited in the minds of the patrons, constituting streams of consciousness that may eventually lead them to resolutions of their respective dilemmas. In this paper, we outline the game and also the AI architecture that makes it possible; the latter combines a light simulation of stimulus processing with a novel approach to natural language generation.",
        "authors": "James Ryan, Tyler Brothers, Michael Mateas, Noah Wardrip-Fruin",
        "bibtex": "@inproceedings{ryan2016jukejoint,\n title={Juke Joint: Characters Who Are Moved By Music},\nauthor={James Ryan and Tyler Brothers and Michael Mateas and Noah Wardrip-Fruin},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12901/12749",
        "local_file": "papers/Juke Joint: Characters Who Are Moved By Music.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14081",
        "title": "Juke Joint: Characters Who Are Moved By Music",
        "year": "2016"
    },
    {
        "abstract": "Computationally assisted performance is a burgeoning area for AI applications, and an important stepping stone toward the dream of generative and personalized narrative experiences. As more pieces of computationally assisted performance are developed, it will become ever more important to develop a vocabulary with which to describe them. Inspired by previous work in creating taxonomies for other related domains, this paper outlines a taxonomy for performance-based experiences, drawn from digital games, traditional theatre, and the hybrid of the two. Having such a taxonomy not only creates a common language with which to discuss such experiences, but reveals unexplored design space in the field, and the particular applications of artificial intelligence necessary to realize them.",
        "authors": "Ben Samuel, James Ryan, Adam Summerville, Michael Mateas, Noah Wardrip-Fruin",
        "bibtex": "@inproceedings{samuel2016computatrum,\n title={Computatrum Personae: Toward a Role-Based Taxonomy of (Computationally Assisted) Performance},\nauthor={Ben Samuel and James Ryan and Adam Summerville and Michael Mateas and Noah Wardrip-Fruin},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12900/12748",
        "local_file": "papers/Computatrum Personae: Toward a Role-Based Taxonomy of (Computationally Assisted) Performance.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14080",
        "title": "Computatrum Personae: Toward a Role-Based Taxonomy of (Computationally Assisted) Performance",
        "year": "2016"
    },
    {
        "abstract": "Boss fights are a memorable and climatic point of many games. In this work we present a programming model for defining boss experiences in 2D action games. The domain we focus on is characterized by real-time movement through a continuous space in which the player and opposing boss damage each other through physical collisions, and player and boss behavior is governed primarily by finite state machines. Our programming model consists of primitive systems such as kinematic physics to store object state and detect collisions paired with finite state machines to define behavior. We describe our model and demonstrate its expressiveness with examples of three classic boss fights from games in The Legend of Zelda, Castlevania, and Sonic the Hedgehog. Our future goals include procedural generation of boss encounters, and we report on the research challenges involved in achieving this goal.",
        "authors": "Kristin Siu, Eric Butler, Alexander Zook",
        "bibtex": "@inproceedings{siu2016boss,\n title={A Programming Model for Boss Encounters in 2D Action Games},\nauthor={Kristin Siu and Eric Butler and Alexander Zook},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12891/12739",
        "local_file": "papers/A Programming Model for Boss Encounters in 2D Action Games.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14058",
        "title": "A Programming Model for Boss Encounters in 2D Action Games",
        "year": "2016"
    },
    {
        "abstract": "In this paper I present ClueGen, a murder mystery game that generates its own narrative. I discuss the genre's suitability for combining gameplay and story using procedural generation techniques, before explaining the implementation and rationale behind ClueGen, utilizing the genre's common structure as an opportunity to define the scope of the generation requirements. In particular I detail a novel system for telegraphing deceptive characters in procedurally generated games with text-based dialogue, by using audible cues.",
        "authors": "Andrew Stockdale",
        "bibtex": "@inproceedings{stockdale2016cluegen,\n title={ClueGen: An Exploration of Procedural Storytelling in the Format of Murder Mystery Games},\nauthor={Andrew Stockdale},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12896/12744",
        "local_file": "papers/ClueGen: An Exploration of Procedural Storytelling in the Format of Murder Mystery Games.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14070",
        "title": "ClueGen: An Exploration of Procedural Storytelling in the Format of Murder Mystery Games",
        "year": "2016"
    },
    {
        "abstract": "Analysing strategic decision-making in eSports is an increasingly important problem -- for players, for teams, for commentators, for viewers and for broadcasters. Such analysis is extremely difficult, however, because of the comparatively small quantities of data, the ever-shifting state of competitive play, and the huge complexity of the game. In this paper we describe a system for predicting drafting decisions in DOTA 2, and evaluate both how the system performs compared to human experts, as well as the new kinds of analysis made possible by automation.",
        "authors": "Adam Summerville, Michael Cook, Ben Steenhuisen",
        "bibtex": "@inproceedings{summerville2016draft,\n title={Draft-Analysis of the Ancients: Predicting Draft Picks in DotA 2 Using Machine Learning},\nauthor={Adam Summerville and Michael Cook and Ben Steenhuisen},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12899/12747",
        "local_file": "papers/Draft-Analysis of the Ancients: Predicting Draft Picks in DotA 2 Using Machine Learning.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14075",
        "title": "Draft-Analysis of the Ancients: Predicting Draft Picks in DotA 2 Using Machine Learning",
        "year": "2016"
    },
    {
        "abstract": "A touted use of Procedural Content Generation is generating content tailored to specific players. Previous work has relied on human identification of player profile features which are then mapped to level generator features. We present a machine-learned technique to train generators on Super Mario Bros. videos, generating levels based on latent play styles learned from the video. We evaluate the generators in comparison to the original levels and a machine-learned generator trained using simulated players.",
        "authors": "Adam Summerville, Matthew Guzdial, Michael Mateas, Mark O. Riedl",
        "bibtex": "@inproceedings{summerville2016tailored,\n title={Learning Player Tailored Content From Observation: Platformer Level Generation from Video Traces using LSTMs},\nauthor={Adam Summerville and Matthew Guzdial and Michael Mateas and Mark O. Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2016}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12895/12743",
        "local_file": "papers/Learning Player Tailored Content From Observation: Platformer Level Generation from Video Traces using LSTMs.pdf",
        "old_url": "http://aaai.org/ocs/index.php/AIIDE/AIIDE16/paper/view/14069",
        "title": "Learning Player Tailored Content From Observation: Platformer Level Generation from Video Traces using LSTMs",
        "year": "2016"
    },
    {
        "abstract": "Creating reasonable AI for sidekicks in games has proven to be a difficult challenge synthetizing player modelling and cooperative planning, both being problems hard by themselves. In this paper, we experiment with designing around these problems: we propose a cooperative puzzle-platformer game that was designed to look similarly to the mainstream of the genre, but to allow for an easy implementation of a quality sidekick AI, letting us test player reactions to the AI. The game was designed so that it is easy for the AI to find optimal solutions while the problem is relatively hard for a human player. We gathered survey responses from players who played the game online (N=28). While the AI sidekick was reported as likeable and helpful, players still reported greater enjoyment of the game when they were allowed to control the sidekick themselves. These findings indicate that the AI itself is not the only obstacle to truly enjoyable gameplay with an AI sidekick.",
        "authors": "Martin Cerny",
        "bibtex": "@inproceedings{cerny2015likeable,\n title={Sarah and Sally: Creating a Likeable and Competent AI Sidekick for a Videogame},\nauthor={Martin Cerny},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12815/12663",
        "local_file": "papers/Sarah and Sally: Creating a Likeable and Competent AI Sidekick for a Videogame.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11563",
        "title": "Sarah and Sally: Creating a Likeable and Competent AI Sidekick for a Videogame",
        "year": "2015"
    },
    {
        "abstract": "In this paper we present a technique for procedurally generating sections of 3D level geometry using computational evolution and guided by the visibility of certain game objects or areas during play. We show that certain level design goals can be achieved in the resulting levels, such as encouraging or dissuading player sightings of certain objects or locations. We also give details of a simple study of players on the generated levels, and discuss how this might be expanded to incorporate more complex problems related to level design.",
        "authors": "Michael Cook",
        "bibtex": "@inproceedings{cook2015vision,\n title={Would You Look At That! Vision-Driven Procedural Level Design},\nauthor={Michael Cook},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12818/12666",
        "local_file": "papers/Would You Look At That! Vision-Driven Procedural Level Design.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11588",
        "title": "Would You Look At That! Vision-Driven Procedural Level Design",
        "year": "2015"
    },
    {
        "abstract": "We sketch the process of creating a novel video game by blending two video games specified in the Video Game Description Language (VGDL), following the COINVENT computational model of conceptual blending. We highlight the choices that need to be made in this process, and discuss the prospects for a computational game designer based on blending.",
        "authors": "Jeremy Gow, Joseph Corneli",
        "bibtex": "@inproceedings{gow2015blending,\n title={Towards Generating Novel Games Using Conceptual Blending},\nauthor={Jeremy Gow and Joseph Corneli},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12824/12671",
        "local_file": "papers/Towards Generating Novel Games Using Conceptual Blending.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11619",
        "title": "Towards Generating Novel Games Using Conceptual Blending",
        "year": "2015"
    },
    {
        "abstract": "We present Fiascomatic, a mixed initiative system for generating consistent scenarios for the indie storytelling RPG Fiasco. Players can repeatedly generate scenarios, locking down aspects of a scenario they like and regenerating aspects they don't, until they arrive at a scenario they find entertaining. It is not a story generation system; it generates scenarios from which players then generate stories. Nor is it intended to generate optimal scenarios; it generates random scenarios which the players can then curate according to their taste. Fiascomatic presents an interesting intermediate point between non-automated table-top RPGs and fully automated systems such as story generators or autonomous characters. It is a tool that can be used by Fiasco players to speed the generation of game setups while preserving creative input on the part of the players, and by Fiasco playset authors to make automated playsets.",
        "authors": "Ian D. Horswill",
        "bibtex": "@inproceedings{horswill2015fiascomatic,\n title={Fiascomatic: A Framework for Automated Fiasco Playsets},\nauthor={Ian D. Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12823/12670",
        "local_file": "papers/Fiascomatic: A Framework for Automated Fiasco Playsets.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11618",
        "title": "Fiascomatic: A Framework for Automated Fiasco Playsets",
        "year": "2015"
    },
    {
        "abstract": "Research has indicated that role models have the potential to boost academic performance. In this paper, we describe an experiment exploring role models as game avatars in an educational game. Of particular interest are the effects of these avatars on players' performance and engagement. Participants were randomly assigned to a condition: a) user selected role model avatar, or b) user selected shape avatar. Results suggest that role models are heavily preferred. African American participants had higher game affect in the role model condition. South Asian participants had higher self-reported engagement in the role model condition. Participants that completed <= 1 levels had higher performance in the role model condition. General trends suggest that the role model's gender and racial closeness with the player, could play a role in player performance and self-reported engagement as consistent with the social science literature.",
        "authors": "Dominic Kao, D. Fox Harrell",
        "bibtex": "@inproceedings{kao2015avatars,\n title={Exploring the Use of Role Model Avatars in Educational Games},\nauthor={Dominic Kao and D. Fox Harrell},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12814/12662",
        "local_file": "papers/Exploring the Use of Role Model Avatars in Educational Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11557",
        "title": "Exploring the Use of Role Model Avatars in Educational Games",
        "year": "2015"
    },
    {
        "abstract": "We present a system for autonomously generating puzzles in the form of a 2D, tile-based world. Puzzle design is entirely dependent on tile characteristics, which are implemented as abstract classes that can be modified by the system. Thus, the system controls not only the base-level puzzle design but also (to some extent) the meta-level component design. The result is a rich space of possible puzzles that the system explores with a combination of evolutionary computation and Q-learning. The system autonomously produces a variety of puzzles of varying difficulty to create a game called Loki's Castle. The system is almost completely autonomous, requiring only a minimal description of what a puzzle should include, and the abstraction allows extensibility so that future versions can invent entirely new classes of tiles. Several puzzle examples are presented to demonstrate the system's capability.",
        "authors": "Dean M. LeBaron, Logan A. Mitchell, Dan Ventura",
        "bibtex": "@inproceedings{lebaron2015abstraction,\n title={Intelligent Content Generation via Abstraction, Evolution and Reinforcement},\nauthor={Dean M. LeBaron and Logan A. Mitchell and Dan Ventura},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12820/12668",
        "local_file": "papers/Intelligent Content Generation via Abstraction, Evolution and Reinforcement.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11601",
        "title": "Intelligent Content Generation via Abstraction, Evolution and Reinforcement",
        "year": "2015"
    },
    {
        "abstract": "This paper describes the structure of a web service able to generate simple game levels via constrained evolutionary optimization. The provided web service allows users to generate playable game levels without needing to understand the underlying process and without having to allocate computational resources for doing so; combined with the highly expressive and customizable generator, a broad range of levels for different genres and purposes can meet many user needs.",
        "authors": "Antonios Liapis",
        "bibtex": "@inproceedings{liapis2015service,\n title={Map Sketch Generation as a Service},\nauthor={Antonios Liapis},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12813/12661",
        "local_file": "papers/Map Sketch Generation as a Service.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11556",
        "title": "Map Sketch Generation as a Service",
        "year": "2015"
    },
    {
        "abstract": "We encounter the results of category formation every day, from demographic categories like race and gender, to role-playing-game classes like \"fighter\" or \"mage\". Category membership is often not simply based on the possession of discrete properties but instead constructed from and reflect the highly nuanced relationships (gradience) between members and best-example individuals called \"prototypes\". In this paper, we present The Marginal, an artificial intelligence (AI)-driven game that (1) computationally models the cognitive categories that players develop when customizing videogame avatars and (2) generates challenges for players to use their perception of visual, textual, and numerical data to progress in a game created using these models. We use archetypal analysis, an AI clustering approach for identifying boundary points in data, to generate tasks in The Marginal for its gameplay. It shows how AI can be combined with games to model and evaluate cognitive categorization phenomena.",
        "authors": "Chong-U Lim, D. Fox Harrell",
        "bibtex": "@inproceedings{lim2015marginal,\n title={The Marginal: A Game for Modeling Players' Perceptions of Gradient Membership in Avatar Categories},\nauthor={Chong-U Lim and D. Fox Harrell},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12819/12667",
        "local_file": "papers/The Marginal: A Game for Modeling Players' Perceptions of Gradient Membership in Avatar Categories.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11589",
        "title": "The Marginal: A Game for Modeling Players' Perceptions of Gradient Membership in Avatar Categories",
        "year": "2015"
    },
    {
        "abstract": "Knowledge and its attendant phenomena are central to human storytelling and to the human experience more generally, but we find very few games that revolve around these concerns. This works to preclude a whole class of narrative experiences in games, and it also damages character believability. In this paper, we present an AI framework that supports gameplay with non-player characters who observe and form knowledge about the world, propagate knowledge to other characters, misremember and forget knowledge, and lie. We outline this framework through the lens of a gameplay experience that is intended to showcase it, called Talk of the Town, which we are currently developing. From a review of earlier projects, we find that our system has a novel combination of features found only independently across other systems, and that it is among the first to support character memory fallibility.",
        "authors": "James Owen Ryan, Adam Summerville, Michael Mateas, Noah Wardrip-Fruin",
        "bibtex": "@inproceedings{ryan2015lie,\n title={Toward Characters Who Observe, Tell, Misremember, and Lie},\nauthor={James Owen Ryan and Adam Summerville and Michael Mateas and Noah Wardrip-Fruin},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12825/12672",
        "local_file": "papers/Toward Characters Who Observe, Tell, Misremember, and Lie.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11667",
        "title": "Toward Characters Who Observe, Tell, Misremember, and Lie",
        "year": "2015"
    },
    {
        "abstract": "Procedural Content Generation (PCG) using machine learning is a fast growing area of research. Action Role Playing Game (ARPG) levels represent an interesting challenge for PCG due to their multi-tiered structure and nonlinearity. Previous work has used Bayes Nets (BN) to learn properties of the topological structure of levels from The Legend of Zelda. In this paper we describe a method for sampling these learned distributions to generate valid, playable level topologies. We carry this deeper and learn a sampleable representation of the individual rooms using Principal Component Analysis. We combine the two techniques and present a multi-scale machine learned technique for procedurally generating ARPG levels from a corpus of levels from The Legend of Zelda.",
        "authors": "Adam James Summerville, Michael Mateas",
        "bibtex": "@inproceedings{summerville2015probabilistic,\n title={Sampling Hyrule: Multi-Technique Probabilistic Level Generation for Action Role Playing Games},\nauthor={Adam James Summerville and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12817/12665",
        "local_file": "papers/Sampling Hyrule: Multi-Technique Probabilistic Level Generation for Action Role Playing Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11570",
        "title": "Sampling Hyrule: Multi-Technique Probabilistic Level Generation for Action Role Playing Games",
        "year": "2015"
    },
    {
        "abstract": "Placing decorative content in any virtual environment is not a trivial task, as the location of even non-critical content influences player movement choices through the level, as well as the general game aesthetic. In this work we use path visibility properties to define and investigate three methods for content placement in a game level, aimed at generating shared, unique, and never seen content. We compare and evaluate the three approaches using a human study where each player was given a level layout based on our three methods, showing our directed process has a non-trivial and controllable impact on player movement.",
        "authors": "Jonathan Tremblay, Clark Verbrugge",
        "bibtex": "@inproceedings{tremblay2015decorative,\n title={An Algorithmic Approach to Decorative Content Placement},\nauthor={Jonathan Tremblay and Clark Verbrugge},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12821/12669",
        "local_file": "papers/An Algorithmic Approach to Decorative Content Placement.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11606",
        "title": "An Algorithmic Approach to Decorative Content Placement",
        "year": "2015"
    },
    {
        "abstract": "Markov chains are an enticing option for machine learned generation of platformer levels, but offer poor control for designers and are likely to produce unplayable levels. In this paper we present a method for guiding Markov chain generation using Monte Carlo Tree Search that we call Markov Chain Monte Carlo Tree Search (MCMCTS). We demonstrate an example use for this technique by creating levels trained on a corpus of levels from Super Mario Bros. We then present a player modeling study that was run with the hopes of using the data to better inform the generation of levels in future work.",
        "authors": "Adam James Summerville, Shweta Philip, Michael Mateas",
        "bibtex": "@inproceedings{summerville2015mcmcts,\n title={MCMCTS PCG 4 SMB: Monte Carlo Tree Search to Guide Platformer Level Generation},\nauthor={Adam James Summerville and Shweta Philip and Michael Mateas},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2015}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12816/12664",
        "local_file": "papers/MCMCTS PCG 4 SMB: Monte Carlo Tree Search to Guide Platformer Level Generation.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE15/paper/view/11569",
        "title": "MCMCTS PCG 4 SMB: Monte Carlo Tree Search to Guide Platformer Level Generation",
        "year": "2015"
    },
    {
        "abstract": "Procedural content generation is often seen simply as a means to generate stuff, elaborating on or rearranging abstract data types that describe levels or modular pieces of gameplay. Generating content which is situated in an understanding of the real-world is a much harder task; it requires access to large amounts of knowledge, and a good technique for parsing and using that knowledge. In this paper we describe A Rogue Dream, a game prototype which can generate new visual content and change its design based on an input word from the player at the start of the game. We describe the game and the tools it makes use of to do this, and use the game to discuss ways in which such techniques might enable unique kinds of gameplay or new directions for intelligent design tools.",
        "authors": "Michael Cook, Simon Colton",
        "bibtex": "@inproceedings{cook2014rogue,\n title={A Rogue Dream: Automatically Generating Meaningful Content For Games},\nauthor={Michael Cook and Simon Colton},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12745/12593",
        "local_file": "papers/A Rogue Dream: Automatically Generating Meaningful Content For Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9063",
        "title": "A Rogue Dream: Automatically Generating Meaningful Content For Games",
        "year": "2014"
    },
    {
        "abstract": "Due to the virtual nature of Virtual Environments (VE), there is an affordance to change game and avatar features asymmetrically, where the features that are rendered for one participant can be different from those rendered for other participants while still sharing the same virtual world. We are calling these kinds of VEs Asymmetric Virtual Environments (AVE). In this paper we present work on a platform for studying online interactions using an AVE. We do so through a preliminary study that explores the effects of avatar colors on individual and group performance when solving a scavenger hunt in a 3D virtual environment followed by a location identification task in a 2D virtual environment. While the results of this preliminary study are not conclusive, our data seem to indicate that players' avatar colors can indeed influence online performance.",
        "authors": "Ignacio X. Dominguez, David L. Roberts",
        "bibtex": "@inproceedings{domingues2014asymmetric,\n title={Asymmetric Virtual Environments: Exploring the Effects of Avatar Colors on Performance},\nauthor={Ignacio X. Dominguez and David L. Roberts},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12746/12594",
        "local_file": "papers/Asymmetric Virtual Environments: Exploring the Effects of Avatar Colors on Performance.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9065",
        "title": "Asymmetric Virtual Environments: Exploring the Effects of Avatar Colors on Performance",
        "year": "2014"
    },
    {
        "abstract": "Large online repositories of player-generated game content are a popular component of modern interactive digital entertainment. These add-ons are typically referred to as \"mods\", and the communities of co-creators that coalesce around them \"modding communities\". We propose a method to augment these communities with computational agents that encourage creative submissions, which we define as those that are both unexpected and valuable. We propose to combine player experience modelling, computational creativity evaluation and mixed-initiative co-creation to drive modding communities towards more fun and diverse gaming experiences.",
        "authors": "Kazjon Grace, Mary Lou Maher",
        "bibtex": "@inproceedings{grace2014modding,\n title={Towards Computational Co-Creation in Modding Communities},\nauthor={Kazjon Grace and Mary Lou Maher},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12750/12598",
        "local_file": "papers/Towards Computational Co-Creation in Modding Communities.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9088",
        "title": "Towards Computational Co-Creation in Modding Communities",
        "year": "2014"
    },
    {
        "abstract": "Procedural game generation is the automatic creation of all aspects of a playable computer game. Procedural game generation systems require specialized knowledge, virtual worlds, and art assets. In this paper, we show how 3D graphical scenes for interactive fictions can be automatically generated with only knowledge that is readily available in existing knowledge bases or can be acquired via crowdsourcing. The key to 3D scene generation is commonly accepted spatial relationships between different types of objects in different types of scenes. We use a crowdsourcing game to automatically and rapidly acquire spatial relations. The spatial relations are used by an intelligent scene generation system that selects and configures 3D assets within a virtual geometric space.",
        "authors": "Rania Hodhod, Marc Huet, Mark Riedl",
        "bibtex": "@inproceedings{hodhod2014commonsense,\n title={Toward Generating 3D Games with the Help of Commonsense Knowledge and the Crowd},\nauthor={Rania Hodhod and Marc Huet and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12741/12589",
        "local_file": "papers/Toward Generating 3D Games with the Help of Commonsense Knowledge and the Crowd.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9013",
        "title": "Toward Generating 3D Games with the Help of Commonsense Knowledge and the Crowd",
        "year": "2014"
    },
    {
        "abstract": "Reasoning using expressive symbolic representations is a central theme of AI research, yet there are surprisingly few deployed games, even within the AIIDE research community, that use this sort of 'classical' AI. This is partly due to practical and methodological issues, but also due to fundamental mismatches between current game genres and classical AI systems. I will argue that if we want to build games that leverage high-end classical AI techniques like commonsense reasoning and natural language processing, we will also have to develop new game genres and mechanics that better exploit those capabilities. I will also present a design sketch of a game that explores potential game mechanics for classical AI.",
        "authors": "Ian D. Horswill",
        "bibtex": "@inproceedings{horswill2014classical,\n title={Game Design for Classical AI},\nauthor={Ian D. Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12749/12597",
        "local_file": "papers/Game Design for Classical AI.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9086",
        "title": "Game Design for Classical AI",
        "year": "2014"
    },
    {
        "abstract": "The invention of fictional ideas is often a central process in the creative production of artefacts such as poems, music, paintings and games. Currently, fictional ideation is being studied by the Computational Creativity community within the WHIM European project. The aim of WHIM is to develop the What-If Machine, a software system capable of inventing, evaluating and presenting fictional ideas with cultural value. In this paper we explore the potential applications of the What-If Machine in the context of games. Specifically, we propose ways in which the What-If Machine can be used as an assistant for the design of games, by providing ideas about characters, the environment, etc., as well as a creative system during gameplay, through interesting interactions with the player.",
        "authors": "Maria Teresa Llano, Michael Cook, Christian Guckelsberger, Simon Colton, Rose Hepworth",
        "bibtex": "@inproceedings{llano2014ideas,\n title={Towards the Automatic Generation of Fictional Ideas for Games},\nauthor={Maria Teresa Llano and Michael Cook and Christian Guckelsberger and Simon Colton and Rose Hepworth},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12742/12590",
        "local_file": "papers/Towards the Automatic Generation of Fictional Ideas for Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9032",
        "title": "Towards the Automatic Generation of Fictional Ideas for Games",
        "year": "2014"
    },
    {
        "abstract": "Mediation is a plan-based interactive narrative generation algorithm that creates a cascading policy of plans. This policy represents a branching story and can be used by an execution manager in a game to control the series of events that unfold. With a few modifications we show that mediation's search space can embed all possible traversals through a game world. This shift allows gameplay to be modeled as an on-line mediation search where the game's interface is a representation of the underlying graph traversal. In this paper we outline these modifications and present a text-based implementation.",
        "authors": "Justus Robertson, R. Michael Young",
        "bibtex": "@inproceedings{robertson2014online,\n title={Gameplay as On-Line Mediation Search},\nauthor={Justus Robertson and R. Michael Young},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12740/12588",
        "local_file": "papers/Gameplay as On-Line Mediation Search.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9006",
        "title": "Gameplay as On-Line Mediation Search",
        "year": "2014"
    },
    {
        "abstract": "In order to advance the field of neuroscience, we must continue motivating youth to pursue science education. In this report we tested the idea of combining neurogaming with education. We developed a pair of electroencephalography (EEG)-controlled neurogames using inexpensive and/or free tools to teach students about the fundamentals of neuroscience and brain machine interfaces (BMI) through a fun, interactive activity. We report on the particular concepts they allowed us to introduce, the techniques and methods we used, and the effect of the activities on stimulating students' interest in neuroscience, and discuss how to optimize the learning experience. We conclude that educational neurogames could be a key tool for furthering and motivating neuroscience education.",
        "authors": "David Schwarz, Vivek Subramanian, Katie Zhuang, Christine Adamczyk",
        "bibtex": "@inproceedings{schwarz2014eeg,\n title={Educational Neurogaming: EEG-Controlled Videogames as Interactive Teaching Tools For Introductory Neuroscience},\nauthor={David Schwarz and Vivek Subramanian and Katie Zhuang and Christine Adamczyk},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12747/12595",
        "local_file": "papers/Educational Neurogaming: EEG-Controlled Videogames as Interactive Teaching Tools For Introductory Neuroscience.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9066",
        "title": "Educational Neurogaming: EEG-Controlled Videogames as Interactive Teaching Tools For Introductory Neuroscience",
        "year": "2014"
    },
    {
        "abstract": "The future of procedural content generation (PCG) lies beyond the dominant motivations of 'replayability' and creating large environments for players to explore. This paper explores both the past and potential future for PCG, identifying five major lenses through which we can view PCG and its role in a game: data vs. process intensiveness, the interactive extent of the content, who has control over the generator, how many players interact with it, and the aesthetic purpose for PCG being used in the game. Using these lenses, the paper proposes several new research directions for PCG that require both deep technical research and innovative game design.",
        "authors": "Gillian Smith",
        "bibtex": "@inproceedings{smith2014future,\n title={The Future of Procedural Content Generation in Games},\nauthor={Gillian Smith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12748/12596",
        "local_file": "papers/The Future of Procedural Content Generation in Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9078",
        "title": "The Future of Procedural Content Generation in Games",
        "year": "2014"
    },
    {
        "abstract": "Platformer games let players solve real-time, physics-based puzzles by jumping and moving around to reach different goals. Designing levels for this context is a non-trivial task; the placement of well-timed jumps, moving platforms, interesting traps, etc., has a complex relationship to in-game challenge and the existence of possible solutions. In this work, we describe three different search algorithms (A*, MCTS and RRT) that could be used to simulate player be- haviour in the platformer domain. We evaluate and compare the three approaches applied to three non-trivial levels, showing a possible iterative workflow of use to designers, and research progress in designing search algorithms for platformer games.",
        "authors": "Jonathan Tremblay, Alexander Borodovski, Clark Verbrugge",
        "bibtex": "@inproceedings{tremblay2014jump,\n title={I Can Jump! Exploring Search Algorithms for Simulating Platformer Players},\nauthor={Jonathan Tremblay and Alexander Borodovski and Clark Verbrugge},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12744/12592",
        "local_file": "papers/I Can Jump! Exploring Search Algorithms for Simulating Platformer Players.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9057",
        "title": "I Can Jump! Exploring Search Algorithms for Simulating Platformer Players",
        "year": "2014"
    },
    {
        "abstract": "The General Mediation Engine is an architecture for producing game experiences with world mechanics drawn from a planning domain and problem. The system models possible player actions, state updates, and system responses in a graph representation derived from planner input. Paired with an interface that displays state and action information to the player, GME structures gameplay as an on-line expansion of its graph representation.",
        "authors": "Justus Robertson, R. Michael Young",
        "bibtex": "@inproceedings{robertson2014mediation,\n title={The General Mediation Engine},\nauthor={Justus Robertson and R. Michael Young},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://ojs.aaai.org/index.php/AIIDE/article/download/12739/12587",
        "local_file": "papers/The General Mediation Engine.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9005",
        "title": "The General Mediation Engine",
        "year": "2014"
    },
    {
        "abstract": "This paper introduces a software framework, currently in prototype stage, designed to permit automatic integration of pathfinding navigation in isomertric camera-driven games. This framework is built with an emphasis towards touchscreen-driven gameplay on tablets and smartphones. This enables pathfinding to be adopted not by characters in-game, but also permits a range of traditional and experimental control schemes to utilise this feature. In addition, the framework provides for a range of metrics to be established based on user activity; enabling quality assurance to be conducted based on raw-user input and pre-processed data.",
        "authors": "Tommy Thompson, Michele Vinciguerra",
        "bibtex": "@inproceedings{thompson2014touch,\n title={Integrated Pathfinding and Player Analysis for Touch-Driven Games},\nauthor={Tommy Thompson and Michele Vinciguerra},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2014}}",
        "link": "https://cdn.aaai.org/ojs/12743/12743-52-16260-1-2-20201228.pdf",
        "local_file": "papers/Integrated Pathfinding and Player Analysis for Touch-Driven Games.pdf",
        "old_url": "https://www.aaai.org/ocs/index.php/AIIDE/AIIDE14/paper/view/9039",
        "title": "Integrated Pathfinding and Player Analysis for Touch-Driven Games",
        "year": "2014"
    },
    {
        "abstract": "Procedural Content Generation is widely used in games, however, its use in educational puzzle games has been limited. These types of games present common challenges such as solvability and non triviality, but also the extra challenge of preserving intended learning goals. In this paper, we present a modular constructive approach to generate levels in a puzzle programming game. The approach uses a grammar to generate game elements from code and works backwards from the solution to ensure solvability, controllability over the solution, and variation, allowing for alternative solutions that preserve the learning goals.",
        "authors": "Chaima Jemmali, Carter Ithier, Seth Cooper and Magy Seif El-Nasr",
        "bibtex": "@inproceedings{jemmali2020grammar,\n title={Grammar Based Modular Level Generator for a Programming Puzzle Game},\nauthor={Chaima Jemmali and Carter Ithier and Seth Cooper and Magy Seif El-Nasr},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2020}}",
        "link": "http://ceur-ws.org/Vol-2862/paper12.pdf",
        "local_file": "papers/Grammar Based Modular Level Generator for a Programming Puzzle Game",
        "old_url": "http://ceur-ws.org/Vol-2862/paper12.pdf",
        "title": "Grammar Based Modular Level Generator for a Programming Puzzle Game",
        "year": "2020"
    },
    {
        "abstract": "Automated feedback has the potential to provide significant assistance to student game creators. Here, we present a system for generating automated, critiquelike feedback for students creating games in the Study-Crafter platform. We implemented a system that builds a personalized feedback report for students based on a templated format. This critique uses automated analysis of structural and interactive aspects of the game narrative and recommends alternate games for students to examine as inspiration. To test our system, we conducted a pilot study with 10 student groups developing narrative-based games. A key understanding from the study is that determining the appropriate depth of assessment and critique without overwhelming the student is important.",
        "authors": "Shruti Mahajan, Leo Bunyea, Nathan Partlan, Dylan Schout, Casper Harteveld, Camillia Matuk, Will Althoff, Tyler Duke, Steven Sutherland, Gillian Smith",
        "bibtex": "@inproceedings{mahajan2019critique,\n title={Toward Automated Critique for Student-Created Interactive Narrative Projects},\nauthor={Shruti Mahajan and Leo Bunyea and Nathan Partlan and Dylan Schout and Casper Harteveld and Camillia Matuk and Will Althoff and Tyler Duke and Steven Sutherland and Gillian Smith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2019}}",
        "link": "https://par.nsf.gov/servlets/purl/10123274",
        "local_file": "papers/Toward Automated Critique for Student-Created Interactive Narrative Projects.pdf",
        "old_url": "archive/mahajan2019critique.pdf",
        "title": "Toward Automated Critique for Student-Created Interactive Narrative Projects",
        "year": "2019"
    },
    {
        "abstract": "Datasets of game levels are increasingly used, for example as training data for PCGML algorithms, exhaustive PCG, or pre-computed parts of larger levels. However, tools for exploring these datasets are limited. In this work we describe an interactive tool for visual exploration of large tile level datasets. The tool currently supports level elements including both image- and text-based tile grids, path graph edges, and arbitrary string tags. The tool visualizes the levels and allows the user to select elements that they would like to be present, and filters the dataset to find all levels consistent with the user's selection. We also describe an efficient encoding scheme used for level filtering, along with example cases of several games, demonstrating handling of datasets consisting of millions of levels. ",
        "authors": "Seth Cooper, Faisal Abutarab, Emily Halina and Nathan Sturtevant",
        "bibtex": "@inproceedings{cooper2023visual,\n title={Visual Exploration of Tile Level Datasets},\nauthor={Seth Cooper, Faisal Abutarab, Emily Halina and Nathan Sturtevant},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Visual Exploration of Tile Level Datasets.pdf",
        "old_url": "",
        "title": "Visual Exploration of Tile Level Datasets",
        "year": "2023"
    },
    {
        "abstract": "While simulated story worlds have proven to be fertile ground for emergent storytelling in research and in commercial game genres such as life simulation, 4X, and roguelikes, they have also proven challenging to create. Building these simulations can involve hand-authoring large amounts of content that provide context for character decision-making, ensure variation among generated narratives, and align with the simulation's narrative setting and themes. This short paper discusses preliminary work on leveraging ChatGPT to generate theme-relevant content for \textit{Neighborly}, a character-driven settlement simulation framework designed for narrative generation. Given a textual description of the narrative setting, we demonstrate how ChatGPT can be used to generate Python code for characters' businesses, occupations, and traits. We discuss challenges with development and future work. ",
        "authors": "Shi Johnson-Bey, Michael Mateas, Noah Wardrip-Fruin",
        "bibtex": "@inproceedings{johnson-bey2023theme,\n title={Toward Using ChatGPT to Generate Theme-Relevant Simulated Storyworlds},\nauthor={Shi Johnson-Bey, Michael Mateas, Noah Wardrip-Fruin},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Toward Using ChatGPT to Generate Theme-Relevant Simulated Storyworlds.pdf",
        "old_url": "",
        "title": "Toward Using ChatGPT to Generate Theme-Relevant Simulated Storyworlds",
        "year": "2023"
    },
    {
        "abstract": "Fictional languages are an aspect present in many hand-authored narratives, but underexplored in procedurally generated narratives. This paper presents an initial exploration of procedurally generated constructed languages (conlangs), following principles of language construction that relate phonology, morphology, and syntax. We present this generator as a tool for game developers. Our approach allows procedurally generated worlds and narratives to draw upon a generative space of languages that follow plausible linguistic principles.",
        "authors": "Aaron Cai, Chris Martens",
        "bibtex": "@inproceedings{cai2023constructed,\n title={Towards Procedural Generation of Constructed Languages for Games},\nauthor={Aaron Cai, Chris Martens},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Towards Procedural Generation of Constructed Languages for Games.pdf",
        "old_url": "",
        "title": "Towards Procedural Generation of Constructed Languages for Games",
        "year": "2023"
    },
    {
        "abstract": "In recent years, video game streaming has enjoyed ever-growing popularity. While streaming game play, a streamer is also expected to provide commentary on gameplay and otherwise entertain the audience. The mental burden for providing such commentary while also playing the game may provide a barrier of entry for new streamers. In this paper, we present an approach to automatically generate streaming commentary during game play for the game League of Legends. Our system recognizes key events, and uses generative AI services to generate voice output. We also present a preliminary evaluation of our system, both in quantitative terms of event recognition accuracy, as well as qualitatively by discussing the generated commentary.",
        "authors": "Noah Renella, Markus Eger",
        "bibtex": "@inproceedings{renella2023commentary\n title={Towards Automated Video Game Commentary Using Generative AI},\nauthor={Noah Renella, Markus Eger},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Towards Automated Video Game Commentary Using Generative AI.pdf",
        "old_url": "",
        "title": "Towards Automated Video Game Commentary Using Generative AI",
        "year": "2023"
    },
    {
        "abstract": "Text-adventure games and text role-playing games are grand challenges for reinforcement learning game playing agents.Text role-playing games are open-ended environments where an agent must faithfully play a particular character. We consider the distinction between characters and actors, where an actor agent has the ability to play multiple characters. We present a framework we call a thespian agent that can learn to emulate multiple characters along with a soft prompt that can be used to direct it as to which character to play at any time. We further describe an attention mechanism that allows the agent to learn new characters that are based on previously learned characters in a few-shot fashion. We show that our agent outperforms the state of the art agent framework in multi-character learning and few-shot learning. ",
        "authors": "Christopher Cui, Xiangyu Peng, Mark Riedl",
        "bibtex": "@inproceedings{cui2023thespian\n title={Thespian: Multi-Character Text Role-Playing Game Agents},\nauthor={Christopher Cui, Xiangyu Peng, Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Thespian Multi-Character Text Role-Playing Game Agents.pdf",
        "old_url": "",
        "title": "Thespian: Multi-Character Text Role-Playing Game Agents",
        "year": "2023"
    },
    {
        "abstract": "Moirai is a system that governs a social simulation experience from initialization, through the simulation, to its end. Previous social simulation experiences have usually utilized bespoke glue code that chains together the different aspects of running a social simulation, utilizing simulation either before play, during play, or after play. Moirai is capable of chaining together different initialization passes and simulation modules to enable a range of experiences that have not been shown before. This paper presents the syntax and semantics of the Moirai Domain Specific Language, and demonstrates how it can be used to create a variety of complex simulation-driven narratives inspired by case-studies from previously existing media.",
        "authors": "Ben Samuel, Adam Summerville",
        "bibtex": "@inproceedings{samuel2023morai\n title={Moirai: Enabling Complex Narrative Structure in Simulation-Driven Stories},\nauthor={Ben Samuel, Adam Summerville},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Moirai: Enabling Complex Narrative Structure in Simulation-Driven Stories.pdf",
        "old_url": "",
        "title": "Moirai Enabling Complex Narrative Structure in Simulation-Driven Stories",
        "year": "2023"
    },
    {
        "abstract": "In this paper, we present Little Learning Machines, a groundbreaking game that enables players to take on the role of a reinforcement learning (RL) trainer. Utilizing reward and environment modeling, players train miniature robots to perform tasks, creating an open-ended space for exploring and crafting behavior. Notably, the game introduces innovative methods for executing RL in near real-time, a significant stride in the field. We delve into the technical challenges and solutions encountered in implementing a robust and dynamic simulation for this RL platform. Early player feedback attests to the game’s compelling blend of education and entertainment, pointing to potential avenues for enhancements and expansions to further enrich the player experience. This pioneering game not only demystifies RL but also serves as a versatile tool for learning, research, and creativity in the realm of artificial intelligence.",
        "authors": "Dante Camarena, Nick Counter, Daniil Markelov, Pietro Gagliano, Don Nguyen,Rhys Becker, Fiona Firby, Zina Rahman, Richard Rosenbaum, Liam A. Clarke and Maria Skibinski",
        "bibtex": "@inproceedings{camarena2023casual\n title={Little Learning Machines Real-Time Deep Reinforcement Learning as a Casual Creativity Game},\nauthor={Dante Camarena, Nick Counter, Daniil Markelov, Pietro Gagliano, Don Nguyen,Rhys Becker, Fiona Firby, Zina Rahman, Richard Rosenbaum, Liam A. Clarke and Maria Skibinski},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Little Learning Machines Real-Time Deep Reinforcement Learning as a Casual Creativity Game.pdf",
        "old_url": "",
        "title": "Little Learning Machines Real-Time Deep Reinforcement Learning as a Casual Creativity Game",
        "year": "2023"
    },
    {
        "abstract": "Graphs are a common format for procedurally generated content in games. However, many graph-based approaches require grammars to be manually authored or additional processing to add spatial layout information. In this work, we extend an existing system for constrained graph generation that learns from examples. The main extension is adding graph layout information directly into the graph learning and generation constraint problem by incorporating transforms. We demonstrate the approach in several level generation applications and potential use as a tool in citizen science games. ",
        "authors": "Seth Cooper, Eden Balema",
        "bibtex": "@inproceedings{cooper2023graph\n title={Learning Constrained Graph Layout for Content Generation},\nauthor={Seth Cooper, Eden Balema},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Learning Constrained Graph Layout for Content Generation.pdf",
        "old_url": "",
        "title": "Learning Constrained Graph Layout for Content Generation",
        "year": "2023"
    },
    {
        "abstract": "Player goals in games are often framed in terms of achieving something in the game world, but this framing can fail to capture goals centered on the player's own mental model, such as seeking the answers to questions about the game world. We use a least-commitment model of interactive narrative to characterize these knowledge goals and the problem of knowledge goal recognition. As a first attempt to solve the knowledge goal recognition problem, we adapt a classical goal recognition paradigm, but in our empirical evaluation the approach suffers from a high rate of incorrectly rejecting a synthetic player's true goals; we discuss how handling of player goals could be made more robust in practice.",
        "authors": "Cory Siler, Stephen G. Ware",
        "bibtex": "@inproceedings{siler2023goal\n title={Knowledge Goal Recognition for Interactive Narratives},\nauthor={Cory Siler, Stephen G. Ware},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Knowledge Goal Recognition for Interactive Narratives.pdf",
        "old_url": "",
        "title": "Knowledge Goal Recognition for Interactive Narratives",
        "year": "2023"
    },
    {
        "abstract": "In this paper, we introduce our system HarmonyMapper, a system for generating diverse musical sequences. By combining the MAP Elites algorithm with insights from music theory, specifically Neo-Riemannian Theory, HarmonyMapper is able to generate sets of chord sequences with a high-level diversity in terms of the emotions they are expected to elicit. Our intention is that this system will form the basis for a mixed-initiative musical composition tool focused on generating diverse music for digital games. While HarmonyMapper is limited in the musical complexity it can produce, our pilot experiments showed that it is capable of generating large numbers of varied sequences with no input data and only limited set up and computational resources required.",
        "authors": "Sara Cardinale, Oliver Withington",
        "bibtex": "@inproceedings{cardinale2023harmonymapper\n title={HarmonyMapper: Generating Emotionally Diverse Chord Progressions for Games},\nauthor={Sara Cardinale, Oliver Withington},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/HarmonyMapper Generating Emotionally Diverse Chord Progressions for Games.pdf",
        "old_url": "",
        "title": "HarmonyMapper: Generating Emotionally Diverse Chord Progressions for Games",
        "year": "2023"
    },
    {
        "abstract": "With growing interest in Procedural Content Generation (PCG) it becomes increasingly important to develop methods and tools for evaluating and comparing alternative systems. There is a particular lack regarding the evaluation of generative pipelines, where a set of generative systems work in series to make iterative changes to an artifact. We introduce a novel method called Generative Shift for evaluating the impact of individual stages in a PCG pipeline by quantifying the impact that a generative process has when it is applied to a pre-existing artifact. We explore this technique by applying it to a very rich dataset of Minecraft game maps produced by a set of alternative settlement generators developed as part of the Generative Design in Minecraft Competition (GDMC), all of which are designed to produce appropriate settlements for a pre-existing map. While this is an early exploration of this technique we find it to be a promising lens to apply to PCG evaluation, and we are optimistic about the potential of Generative Shift to be a domain-agnostic method for evaluating generative pipelines.",
        "authors": "Jean-Baptiste Hervé, Oliver Withington, Marion Hervé, Laurissa Tokarchuk and Christoph Salge",
        "bibtex": "@inproceedings{herve2023shift\n title={Exploring Minecraft Settlement Generators with Generative Shift Analysis},\nauthor={Jean-Baptiste Hervé, Oliver Withington, Marion Hervé, Laurissa Tokarchuk and Christoph Salge},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Exploring Minecraft Settlement Generators with Generative Shift Analysis.pdf",
        "old_url": "",
        "title": "Exploring Minecraft Settlement Generators with Generative Shift Analysis",
        "year": "2023"
    },
    {
        "abstract": "Declarative programming offers several advantages in terms of compactness and modularity. Logic programming and rule-based systems are often chosen for tasks such as social simulation because their use of declarative rules and predicates map well to rules of social engagement. Unfortunately, declarative programming is often quite slow, making it inappropriate for large systems or high-frequency updates. This is partly because of its use of search algorithms, but also because of its heavy use of pointer chasing, dynamic allocation, garbage collection, and runtime type-checking. In this paper, we discuss how bottom-up execution of logic programs can be implemented without these issues. We argue that character simulation is a “sweet spot” for bottom-up logic programming, allowing character behavior to be specified in terms of declarative rules, while offering performance competitive with Python systems such as Talk of the Town. We present a language, TED, which offers very good performance and has been used both in research and in an unannounced commercial game. ",
        "authors": "Ian Horswill, Samuel Hill",
        "bibtex": "@inproceedings{\n title={Fast, Declarative, Character Simulation Using Bottom-Up Logic Programming},\nauthor={Ian Horswill, Samuel Hill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Fast, Declarative, Character Simulation Using Bottom-Up Logic Programming.pdf",
        "old_url": "",
        "title": "Fast, Declarative, Character Simulation Using Bottom-Up Logic Programming",
        "year": "2023"
    },
    {
        "abstract": "This paper describes an in-progress research study that examines the perceptions and usability of generative AI (GAI) in MassDigi’s Summer Innovation Program— a professional development program where teams of interns create mobile games in the Unity game engine over an 11-week period. GAI applications are being deployed across industries worldwide, but the impacts of using this technology in particular fields are relatively unexplored. The goal of this research study is to identify the potential harms and benefits of GAI in the games industry, with particular focus on how it impacts the creative processes.",
        "authors": "Josiah Boucher, Gillian Smith, Yunus Telliel",
        "bibtex": "@inproceedings{boucher2023genai\n title={Examining Early Professionals' Use of Generative AI in the Game Development Process},\nauthor={Josiah Boucher, Gillian Smith, Yunus Telliel},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Examining Early Professionals' Use of Generative AI in the Game Development Process.pdf",
        "old_url": "",
        "title": "Examining Early Professionals' Use of Generative AI in the Game Development Process",
        "year": "2023"
    },
    {
        "abstract": "Monte Carlo Tree Search is a widely acknowledged algorithm with video games being a common application. While MCTS has seen various enhancements, its integration with temporal difference learning (TD learning) in complex search environments still has interesting research potential. This paper introduces a novel method, Conv-AE+FA, merging convolutional autoencoders with a linear function approximator to optimize game states. Applied to a game setting inspired by the commercial game XCOM, our study not only delves into the use of TD learning for guiding MCTS but also underscores the improved guidance in the MCTS search achieved by the use of convolutional autoencoders with linear approximation.",
        "authors": "Yiwei Zhang, Richard Zhao",
        "bibtex": "@inproceedings{zhang2023mcts\n title={Enhancing MCTS with Convolutional Autoencoder and Linear Approximator in XCOM-Inspired Environments},\nauthor={Yiwei Zhang, Richard Zhao},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Enhancing MCTS with Convolutional Autoencoder and Linear Approximator in XCOM-Inspired Environments.pdf",
        "old_url": "",
        "title": "Enhancing MCTS with Convolutional Autoencoder and Linear Approximator in XCOM-Inspired Environments",
        "year": "2023"
    },
    {
        "abstract": "One major challenge in reinforcement learning (RL) is the large amount of steps for the RL agent needs to converge in the training process and learn the optimal policy, especially in text-based game environments where the action space is extensive. However, non-player characters (NPCs) sometimes hold some key information about the game, which can potentially help to train RL agents faster. Thus, this paper explores how to interact and converse with NPC agents to get the key information using large language models (LLMs), as well as incorporate this information to speed up RL agent's training using knowledge graphs (KGs) and Story Shaping.",
        "authors": "Wei Zhou, Xiangyu Peng Mark Riedl",
        "bibtex": "@inproceedings{zhou2023dialogue\n title={Dialogue Shaping Empowering Agents through NPC Interaction},\nauthor={Wei Zhou, Xiangyu Peng Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/Dialogue Shaping Empowering Agents through NPC Interaction.pdf",
        "old_url": "",
        "title": "Dialogue Shaping Empowering Agents through NPC Interaction",
        "year": "2023"
    },
    {
        "abstract": "Social simulations often need many of the same things – characters, locations, interactions, and relationships to name a few. These regular components of simulators are present in games ranging from major titles like The Sims, indie classics like Dwarf Fortress, and experimental interactive experiences such as Bad News (or at least in the simulator Bad News is build off – Talk of the Town). Not only do these components need reimplementation in each sim, but they are also often difficult for anyone but original developers to modify. In this paper we discuss how social simulators can be declaratively authored from an ontology-based representation while still maintaining playable framerates. We argue that an ontology for these entities allows for the expressive and flexible creation of social simulations. We present a language and ontology, Socialog, which enables one to declaratively author a simulation with these ontological statements while maintaining very good performance.",
        "authors": "Samuel Hill, Ian Horswill",
        "bibtex": "@inproceedings{hill2023ontology\n title={An Executable Ontology for Social Simulation},\nauthor={Samuel Hill, Ian Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2023}}",
        "link": "",
        "local_file": "papers/An Executable Ontology for Social Simulation.pdf",
        "old_url": "",
        "title": "An Executable Ontology for Social Simulation",
        "year": "2023"
    },
    {
        "abstract": "As interest in procedural content generation (PCG) for games has increased both commercially and among researchers, so has the need for methodologies for understanding the generative spaces of PCG systems. In this paper we introduce and evaluate a novel approach for visualising the generative spaces of systems for generating game levels, using embeddings extracted from a trained convolutional neural network. We evaluate the approach in terms of its ability to produce 2D visualisations that correlate with the behavioural characteristics of the levels. The results across two alternative game domains, Super Mario and Boxoban, indicate that this approach is powerful in certain settings and worthy of further investigation. However the implementation used in this work was also inconsistent in comparison to the benchmarks, as well as being prone to intermittent failure. We conclude that this method is worthy of further evaluation, but that future implementations of it require significant refinement.",
        "authors": "Oliver Withington, Laurissa Tokarchuk",
        "bibtex": "@inproceedings{withington2022visulaising\n title={Visualising Generative Spaces Using Convolutional Neural Network Embeddings},\nauthor={Oliver Withington, Laurissa Tokarchuk},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Visualising Generative Spaces Using Convolutional Neural Network Embeddings.pdf",
        "old_url": "",
        "title": "Visualising Generative Spaces Using Convolutional Neural Network Embeddings",
        "year": "2022"
    },
    {
        "abstract": "Machine learning has had a great deal of success in image processing. However, the focus of this work has largely been on realistic images, ignoring more niche art styles such as pixel art. Additionally, many traditional machine learning models that focus on groups of pixels do not work well with pixel art, where individual pixels are important. We propose the Pixel VQ-VAE, a specialized VQ-VAE model that learns representations of pixel art. We show that it outperforms other models in both the quality of embeddings as well as performance on downstream tasks.",
        "authors": "Akash Saravanan, Matthew Guzdial",
        "bibtex": "@inproceedings{saravanan2022pixel\n title={Pixel VQ-VAEs for Improved Pixel Art Representation},\nauthor={Akash Saravanan, Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Pixel VQ-VAEs for Improved Pixel Art Representation.pdf",
        "old_url": "",
        "title": "Pixel VQ-VAEs for Improved Pixel Art Representation",
        "year": "2022"
    },
    {
        "abstract": "Music and other sound cues are used to support, enhance and change the experience of playing every type of digital game. In this paper we explore the sonification of game states, the direct translation of game events or situations into music. We present three strategies for allowing AI to convey information to the player using sonification, creating a pleasing soundtrack while also affecting the play experience. We extend this to automated game design and suggest that sonification could be embedded into automated game designers to directly influence the design process",
        "authors": "Sara Cardinale, Michael Cook, Simon Colton",
        "bibtex": "@inproceedings{cardinale2022sonic \n title={AI-Driven Sonification of Automatically Designed Games},\nauthor={Sara Cardinale, Michael Cook, Simon Colton},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/AI-Driven Sonification of Automatically Designed Games.pdf",
        "old_url": "",
        "title": "AI-Driven Sonification of Automatically Designed Games",
        "year": "2022"
    },
    {
        "abstract": "This paper presents an automated methodology for analyzing specific properties of open-endedness in video games. We focus specifically on the phenomenon of door-opening states that expand a possibility space once they are encountered. Our analysis examines door-opening states both in terms of the physical properties of game levels and the cognitive abilities that a player must learn in order to progress through the game. Finally, we demonstrate our methodology on the NES homebrew game Blobquest. ",
        "authors": "L.B. Soros, Nicholas Guttenberg",
        "bibtex": "@inproceedings{soros2022topological \n title={Topological Analysis of Open-Endedness in Video Games},\nauthor={L.B. Soros, Nicholas Guttenberg},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Topological Analysis of Open-Endedness in Video Games.pdf",
        "old_url": "",
        "title": "Topological Analysis of Open-Endedness in Video Games",
        "year": "2022"
    },
    {
        "abstract": "Many games feature a progression of levels that does not change or adapt to the player. This is problematic because some players may get stuck if the progression is too difficult and others may find it boring if it is too slow to get to more challenging levels. One way to address this is to build levels based on the player's performance. In this work, we formulate the problem of generating levels for a player as a Markov Decision Process (MDP) and use adaptive dynamic programming (ADP) to solve the MDP before assembling a level. We tested with two case studies and find that using an ADP outperforms two baselines. Furthermore, we tested with player proxies and switched them in the middle of play, and we show that a simple modification prior to running an ADP results in quick adaptation. By using an ADP, which searches the entire MDP, we produce a dynamic progression of levels that adapts to the player.",
        "authors": "Colan F. Biemer, Seth Cooper",
        "bibtex": "@inproceedings{biemer2022markov \n title={Level Assembly as a Markov Decision Process},\nauthor={Colan F. Biemer, Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Level Assembly as a Markov Decision Process.pdf",
        "old_url": "",
        "title": "Level Assembly as a Markov Decision Process",
        "year": "2022"
    },
    {
        "abstract": "Modern AAA video games feature huge game levels and maps which are increasingly hard for level testers to cover exhaustively. As a result, games often ship with catastrophic bugs such as the player falling through the floor or being stuck in walls. We propose an approach specifically targeted at reachability bugs in simulated 3D environments based on the powerful exploration algorithm, Go-Explore, which saves unique checkpoints across the map and then identifies promising ones to explore from. We show that when coupled with simple heuristics derived from the game's navigation mesh, Go-Explore finds challenging bugs and comprehensively explores complex environments without the need for human demonstration or knowledge of the game dynamics. Go-Explore vastly outperforms more complicated baselines including reinforcement learning with intrinsic curiosity in both covering the navigation mesh and number of unique positions across the map discovered. Finally, due to our use of parallel agents, our algorithm can fully cover a vast 1.5km x 1.5km game world within 10 hours on a single machine making it extremely promising for continuous testing suites.",
        "authors": "Cong Lu, Raluca Georgescu and John Verwey",
        "bibtex": "@inproceedings{lu2022explore\n title={Go-Explore Complex 3D Game Environments for Automated Reachability Testing},\nauthor={Cong Lu, Raluca Georgescu and John Verwey},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Go-Explore Complex 3D Game Environments for Automated Reachability Testing.pdf",
        "old_url": "",
        "title": "Go-Explore Complex 3D Game Environments for Automated Reachability Testing",
        "year": "2022"
    },
    {
        "abstract": "In recent years, Monte Carlo tree search (MCTS) has achieved widespread adoption within the game community. Its use in conjunction with deep reinforcement learning has produced success stories in many applications. While these approaches have been implemented in various games, from simple board games to more complicated video games such as StarCraft, the use of deep neural networks requires a substantial training period. In this work, we explore on-line adaptivity in MCTS without requiring pre-training. We present MCTS-TD, an adaptive MCTS algorithm improved with temporal difference learning. We demonstrate our new approach on the game miniXCOM, a simplified version of XCOM, a popular commercial franchise consisting of several turn-based tactical games, and show how adaptivity in MCTS-TD allows for improved performances against opponents.",
        "authors": "Kimiya Saadat, Richard Zhao",
        "bibtex": "@inproceedings{saadat2022td\n title={Exploring Adaptive MCTS with TD Learning in miniXCOM},\nauthor={Kimiya Saadat, Richard Zhao},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Exploring Adaptive MCTS with TD Learning in miniXCOM.pdf",
        "old_url": "",
        "title": "Exploring Adaptive MCTS with TD Learning in miniXCOM",
        "year": "2022"
    },
    {
        "abstract": "There has been significant research interest in general Procedural Level Generation via Machine Learning (PLGML), applying ML techniques to automated level generation. One recent trend is in the direction of learning representations for level design via embeddings, such as tile embeddings. Tile Embeddings are a continuous vector representation of levels unifying its visual, contextual and behavioral information. However, the original tile embedding struggled to generate levels with skewed tile distributions. For instance, Super Mario Bros. (SMB) wherein a majority of tiles represent the sky or background. To remedy this, we propose a new tile embedding representation and a novel, two-step level generation to leverage this representation. We evaluate the performance of our approach in generating levels for seen and unseen games with skewed tile distributions and compare our performance against the original tile embedding-based generator.",
        "authors": "Mrunal Jadhav, Matthew Guzdial",
        "bibtex": "@inproceedings{jadhav2022tile\n title={Clustering-based Tile Embedding: A General Representation for Level Design with Skewed Tile Distributions},\nauthor={Mrunal Jadhav, Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Clustering-based Tile Embedding A General Representation for Level Design with Skewed Tile Distributions.pdf",
        "old_url": "",
        "title": "Clustering-based Tile Embedding A General Representation for Level Design with Skewed Tile Distributions",
        "year": "2022"
    },
    {
        "abstract": "In this work, we explore various approaches to blending multiple games, by building on the Sturgeon constraint-based 2D tile level generation system. We introduce a game grid, which, when used as an input to the generator, allows elements such as tiles, tile patterns, and reachability rules to be specified on a per-location basis. We demonstrate how the system can: use the layout of one game's levels for another game's tile patterns; generate levels with one game's tile patterns that use another game's reachability rules; and generate levels that combine tiles, tile patterns, and reachability rules from multiple games. ",
        "authors": "Seth Cooper",
        "bibtex": "@inproceedings{cooper2022sturg\n title={Constraint-Based 2D Tile Game Blending in the Sturgeon System},\nauthor={Seth Cooper},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Constraint-Based 2D Tile Game Blending in the Sturgeon System.pdf",
        "old_url": "",
        "title": "Constraint-Based 2D Tile Game Blending in the Sturgeon System",
        "year": "2022"
    },
    {
        "abstract": "Retcon is an experimental interactive narrative engine that allows writers to author stories in which some aspects of the overall story, such as the tone, genre, and character relationships, can be chosen incrementally by the player. Stories are authored as a set of fragments (aka storylets) tagged with their story world assumptions. The system tracks the active assumptions and removes from consideration any fragments that contradict the established story world. This allows the player some degree of co-authorship, and allows her to explore the possibility space of different stories afforded by story worlds.",
        "authors": "Ian Horswill",
        "bibtex": "@inproceedings{horswill2022retcon\n title={Retcon: A Least-Commitment Story-World System},\nauthor={Ian Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Retcon A Least-Commitment Story-World System.pdf",
        "old_url": "",
        "title": "Retcon: A Least-Commitment Story-World System",
        "year": "2022"
    },
    {
        "abstract": "Player modelling is the field of study associated with understanding players. One pursuit in this field is affect prediction: the ability to predict how a game will make a player feel. We present novel improvements to affect prediction by using a deep convolutional neural network (CNN) to predict player experience trained on raw game event logs in tandem with localized level structure information. We test our approach on levels based on \textit{Super Mario Bros.} (\textit{Infinite Mario Bros.}) and \textit{Super Mario Bros.: The Lost Levels} (\textit{Gwario}), as well as original \textit{Super Mario Bros.} levels without retraining. We outperform prior work, and demonstrate the importance of training on player logs, even when lacking them at test time.",
        "authors": "Natalie Bombardieri, Matthew Guzdial",
        "bibtex": "@inproceedings{bombardieri2022deep\n title={Improving Deep Localized Level Analysis: How Game Logs Can Help},\nauthor={Natalie Bombardieri, Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Improving Deep Localized Level Analysis: How Game Logs Can Help.pdf",
        "old_url": "",
        "title": "Improving Deep Localized Level Analysis: How Game Logs Can Help",
        "year": "2022"
    },
    {
        "abstract": "Applying existing or new AI techniques to games often involves either utilizing or creating an open-source implementation of the game to access its internals, or using the graphical output as an AI agent's input. In this paper, we explore reverse-engineering as a third approach. We describe how an open-source emulator for arcade games can be extended to instrument games available only as binaries, and made available for use in AI research. While still requiring some effort for each game, we aim to provide a consistent interface across multiple games that can then be used by AI agents. We show preliminary results of applying this method to three games from different eras and released for different consoles, that are all supported by the underlying emulator.",
        "authors": "William R. Armstrong, Markus Eger",
        "bibtex": "@inproceedings{armstrong2022bizmc\n title={BizMC: A Lua Framework for running Monte Carlo Tree Search in the BizHawk emulator},\nauthor={William R. Armstrong, Markus Eger},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/BizMC A Lua Framework for running Monte Carlo Tree Search in the BizHawk emulator.pdf",
        "old_url": "",
        "title": "BizMC: A Lua Framework for running Monte Carlo Tree Search in the BizHawk emulator",
        "year": "2022"
    },
    {
        "abstract": "In fighting games, individual players of the same skill level often exhibit distinct strategies from one another through their gameplay. Despite this, the majority of AI agents for fighting games have only a single strategy for each ``level'' of difficulty. To make AI opponents more human-like, we'd ideally like to see multiple different strategies at each level of difficulty, a concept we refer to as ``multidimensional'' difficulty. In this paper, we introduce a diversity-based deep reinforcement learning approach for generating a set of agents of similar difficulty that utilize diverse strategies. We find this approach outperforms a human-authored baseline in both diversity and performance. ",
        "authors": "Emily Halina, Matthew Guzdial",
        "bibtex": "@inproceedings{halina2022diversity\n title={Diversity-based Deep Reinforcement Learning Towards Multidimensional Difficulty for Fighting Game AI},\nauthor={Emily Halina, Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Diversity-based Deep Reinforcement Learning Towards Multidimensional Difficulty for Fighting Game AI.pdf",
        "old_url": "",
        "title": "Diversity-based Deep Reinforcement Learning Towards Multidimensional Difficulty for Fighting Game AI",
        "year": "2022"
    },
    {
        "abstract": "Failure and resilience are important aspects of gameplay. This is especially important for serious games or competitive games, where players need to adapt and cope with failure frequently. In such situations, emotion regulation - the active process of modulating ones' emotions to cope and adapt to challenging situations - becomes essential. It is one of the prominent aspects of human intelligence and promotes mental health and well-being. While there has been work on developing artificial emotional regulation assistants to help users cope with emotion regulation in the field of Intelligent Tutoring systems, little is done to incorporate such systems or ideas into (serious) video games. In this paper, we introduce a data-driven 6-phase approach to establish empathetic artificial intelligence (EAI), which operates on raw chat log data to detect key affective states, identify common sequences and emotion regulation strategies and generalizes these to make them applicable for intervention systems.",
        "authors": "Reza Habibi, Johannes Pfau, Jonattan Holmes, Magy Seif El-Nasr",
        "bibtex": "@inproceedings{habibi2022empathetic\n title={Empathetic AI for Empowering Resilience in Games},\nauthor={Reza Habibi, Johannes Pfau, Jonattan Holmes, Magy Seif El-Nasr},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Empathetic AI for Empowering Resilience in Games.pdf",
        "old_url": "",
        "title": "Empathetic AI for Empowering Resilience in Games",
        "year": "2022"
    },
    {
        "abstract": "Real-Time Strategy (RTS) game unit generation is a relatively unexplored area of Procedural Content Generation (PCG) research. This leaves the question of how to generate interesting and balanced units largely unanswered. Creating unique and balanced units can be a difficult task when designing an RTS game. Having an automated method of designing units could help developers speed up the creation process as well as find new ideas. In this work we propose a method of generating and testing new units to be introduced into an RTS game. Drawing on Search-Based PCG and a fitness function based on Monte Carlo Tree Search (MCTS), our approach is capable of generating a variety of units. We present ten units generated by our system designed to be used in the game microRTS, as well as test results demonstrating that these units are unique and balanced.",
        "authors": "Kynan Sorochan, Matthew Guzdial",
        "bibtex": "@inproceedings{sorochan2022rts \n title={Generating Real-Time Strategy Game Units Using Search-Based Procedural Content Generation and Monte Carlo Tree Search},\nauthor={Kynan Sorochan, Matthew Guzdial},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Generating Real-Time Strategy Game Units Using Search-Based Procedural Content Generation and Monte Carlo Tree Search.pdf",
        "old_url": "",
        "title": "Generating Real-Time Strategy Game Units Using Search-Based Procedural Content Generation and Monte Carlo Tree Search",
        "year": "2022"
    },
    {
        "abstract": "We propose to use ontologies and declarative symbolic reasoning to generate emergent behaviours of Non-Player Characters (NPCs). The objective is that the game designer only needs to specify the rules of the game and its components in a declarative way, as he would naturally do in a traditional board game. The logic reasoner will then deduce the NPC behaviours that comply with the game designer's rules without the game designer having to manually specify all the game possibilities by hand. We illustrate this approach on a prototype of the revisited Wumpus World game made on the Unity game engine with a Prolog environment. This approach is combined with the Well-Founded Semantics (WFS) to solve the problem of representation and reasoning despite the lack of NPC knowledge.",
        "authors": "Sylvain Lapeyrade",
        "bibtex": "@inproceedings{lapeyarde2022demo\n title={Demo: Generate Emergent NPC Behaviours With Symbolic Reasoning},\nauthor={Sylvain Lapeyrade},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2022}}",
        "link": "",
        "local_file": "papers/Demo Generate Emergent NPC Behaviours With Symbolic Reasoning.pdf",
        "old_url": "",
        "title": "Demo: Generate Emergent NPC Behaviours With Symbolic Reasoning",
        "year": "2022"
    },
    {
        "abstract": "Video games have historically been limited in the number of characters under AI control. This is all the more true for games that use declarative systems which are generally used for turn-based or otherwise non-real-time games. While a declarative system can obviously be used for a real-time simulation, we wanted to test the limits of how far it can be scaled for large numbers of characters. This paper shows how 5000 characters can run simultaneously and in real-time with 60fps performance on a modern laptop using a declarative logic programming language.",
        "authors": "Samuel Hill, Ian Horswill",
        "bibtex": "@inproceedings{hill20245000,\ntitle={Demo: Generate Emergent NPC Behaviours With Symbolic Reasoning},\nauthor={Samuel Hill, Ian Horswill},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper1.pdf",
        "local_file": "papers/5000 Characters at Video Frame Rate using Declarative Programming.pdf",
        "old_url": "",
        "title": "5000 Characters at Video Frame Rate using Declarative Programming",
        "year": "2024"
    },
    {
        "abstract": "Tier lists are often used to describe the relative power of different competitive game elements. These are used so that players can evaluate the relative power of certain aspects of a competitive game and act accordingly. In the game Pokémon, each Pokémon is assigned into a tier based on its power, performance in tournament play, and potential synergy with other Pokémon it could team with. These tier lists, however, are typically designed based on observation, meaning that their quality could suffer. In this work, we treat tier lists as coalition formation games. By doing this, we can leverage algorithms designed to find stable coalitions. In terms of tier lists, this would mean that each Pokémon would be in the correct tier and have no desire to move to a higher or lower tier. To evaluate this, we examine the Smogon tier list for Generation 1 Pokémon to determine its stability",
        "authors": "Nathan Arnold, Nicholas Fluty, Ryan D. Flores, Judy Goldsmith and Brent Harrison",
        "bibtex": "@inproceedings{arnold2024evaluating,\ntitle={Evaluating the Stability of the Smogon Tier List for Competitive Pokémon Battling},\nauthor={Nathan Arnold, Nicholas Fluty, Ryan D. Flores, Judy Goldsmith and Brent Harrison},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper2.pdf",
        "local_file": "papers/Evaluating the Stability of the Smogon Tier List for Competitive Pokemon Battling.pdf",
        "old_url": "",
        "title": "Evaluating the Stability of the Smogon Tier List for Competitive Pokémon Battling",
        "year": "2024"
    },
    {
        "abstract": "In competitive Pokémon battling, players have adopted a set of extra rules that are meant to encourage fair play. They are used to constrain team formation so that no one team has an overwhelming advantage over all others. These rule sets are often derived based on trial and error, intuition, or post-hoc evaluations of team performance, which means that the rules may not be ideal solutions to the problem they are supposed to address, or the problem may not have been worth addressing. In this paper, we explore how artificial intelligence and machine learning techniques can be used to potentially evaluate the quality of a rule set. This is meant to be a preliminary study that will ultimately lead to the automatic formulation of such rule sets. Our case study investigates how the inclusion or exclusion of one-hit-knock-out (OHKO) moves affects the outcomes and player behaviors in games between two teams battling under Generation 1 rules.",
        "authors": "Nicholas Fluty, Ryan D. Flores, Judy Goldsmith and Brent Harrison",
        "bibtex": "@inproceedings{fluty2024an,\ntitle={An Empirical Analysis of the Validity of Competitive Pokémon Rule Sets},\nauthor={Nicholas Fluty, Ryan D. Flores, Judy Goldsmith, Brent Harrison},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper3.pdf",
        "local_file": "papers/An Empirical Analysis of the Validity of Competitive Pokemon Rule Sets.pdf",
        "old_url": "",
        "title": "An Empirical Analysis of the Validity of Competitive Pokémon Rule Sets",
        "year": "2024"
    },
    {
        "abstract": "In competitive Pokémon battling, players have adopted a set of extra rules that are meant to encourage fair play. They are used to constrain team formation so that no one team has an overwhelming advantage over all others. These rule sets are often derived based on trial and error, intuition, or post-hoc evaluations of team performance, which means that the rules may not be ideal solutions to the problem they are supposed to address, or the problem may not have been worth addressing. In this paper, we explore how artificial intelligence and machine learning techniques can be used to potentially evaluate the quality of a rule set. This is meant to be a preliminary study that will ultimately lead to the automatic formulation of such rule sets. Our case study investigates how the inclusion or exclusion of one-hit-knock-out (OHKO) moves affects the outcomes and player behaviors in games between two teams battling under Generation 1 rules.",
        "authors": "Pearson Garner, Aaron Lin, Ruby Harris, Brent Harrison and Judy Goldsmith",
        "bibtex": "@inproceedings{garner2024arma,\ntitle={ArmA 3 Billeting as a Coalition Formation Game},\nauthor={Pearson Garner, Aaron Lin, Ruby Harris, Brent Harrison and Judy Goldsmith},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper4.pdf",
        "local_file": "papers/ArmA 3 Billeting as a Coalition Formation Game.pdf",
        "old_url": "",
        "title": "ArmA 3 Billeting as a Coalition Formation Game",
        "year": "2024"
    },
    {
        "abstract": "As an artistic aid in tiled level design, Constraint Based Tiling Generation (CBTG) algorithms can help to automatically create level realizations from a set of tiles and placement constraints. Merrell’s Modify in Blocks Model Synthesis (MMS) and Gumin’s Wave Function\nCollapse (WFC) have been proposed as Constraint Based Tiling Generation (CBTG) algorithms that work well for many scenarios but have limitations in problem size, problem setup and solution biasing. We present Punch Out Model Synthesis (POMS), a Constraint Based Tiling Generation algorithm, that can handle large problem sizes, requires minimal assumptions for setup and can help mitigate solution biasing. POMS attempts to resolve indeterminate grid regions by trying to progressively realize sub-blocks, performing a stochastic boundary erosion on previously resolved regions should sub-block resolution fail. We highlight the results of running a\nreference implementation on different tile sets and discuss a tile correlation length, implied by the tile constraints, and its role in choosing an appropriate block size to aid POMS in successfully finding grid realizations.",
        "authors": "Zzyv Zzyzek",
        "bibtex": "@inproceedings{zzyzek2024punch,\ntitle={Punch Out Model Synthesis: A Stochastic Algorithm for Constraint Based Tiling Generation},\nauthor={Zzyv Zzyzek},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper5.pdf",
        "local_file": "papers/Punch Out Model Synthesis A Stochastic Algorithm for Constraint Based Tiling Generation.pdf",
        "old_url": "",
        "title": "Punch Out Model Synthesis: A Stochastic Algorithm for Constraint Based Tiling Generation",
        "year": 2024
    },
    {
        "abstract": "Generative Artificial Intelligence (AI) encounters limitations in efficiency and fairness within the realm of Procedural Content Generation (PCG) when human creators solely drive and bear responsibility for the generative process. Alternative setups, such as Mixed-Initiative Co-Creative (MI-CC) systems, exhibited their promise. Still, the potential of an active mixed initiative, where AI takes a role beyond following, is understudied. This work investigates the influence of the adaptive ability of an active and learning AI agent on creators’ expectancy of creative responsibilities in an MI-CC setting. We built and studied a system that employs reinforcement learning (RL) methods to learn the creative responsibility preferences of a human user during online interactions. Situated in story co-creation, we develop a Multi-armed-bandit agent that learns from the human creator, updates its collaborative decision-making belief, and switches between its capabilities during an MI-CC experience. With 39 participants joining a human subject study, Our developed system’s learning capabilities are well recognized compared to the non-learning ablation, corresponding to a significant increase in overall satisfaction with the MI-CC experience. These findings indicate a robust association between effective MI-CC collaborative interactions, particularly the implementation of proactive AI initiatives, and deepened understanding among all participants.",
        "authors": "Zhiyu Lin, Upol Ehsan, Rohan Agarwal, Samihan Dani, Vidushi Vashishth and Mark Riedl",
        "bibtex": "@inproceedings{lin2024beyond,\ntitle={Beyond Following: Mixing Active Initiative into Computational Creativity},\nauthor={Zhiyu Lin, Upol Ehsan, Rohan Agarwal, Samihan Dani, Vidushi Vashishth and Mark Riedl},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper6.pdf",
        "local_file": "papers/Beyond Following Mixing Active Initiative into Computational Creativity.pdf",
        "old_url": "",
        "title": "Beyond Following: Mixing Active Initiative into Computational Creativity",
        "year": 2024
    },
    {
        "abstract": "Specialized testbeds are valuable tools in game AI and procedural content generation (PCG) research, providing controlled environments to test and evaluate new algorithms and explore game mechanics. This paper introduces MiniStS, a research testbed modeled after the\nrogue-like card game Slay the Spire (StS), tailored for studying game-playing AI and procedural generation. MiniStS features a dynamic rule system where in-game cards can modify game rules, providing a rich context for research. We argue that such an environment offers distinct research opportunities by revealing insights into game design, enabling the exploration of rule combinations and synergies, and advancing AI capabilities. We define possible applications for MiniStS in terms of generalized game-playing that requires understanding and adaptability to the dynamic changes to the rules, and card generation with a focus on a deepened exploration of rule synergies.",
        "authors": "Bahar Bateni, Jim Whitehead",
        "bibtex": "@inproceedings{bateni2024minists,\ntitle={MiniStS: A Testbed for Dynamic Rule Exploration},\nauthor={Bahar Bateni, Jim Whitehead},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper7.pdf",
        "local_file": "papers/MiniStS A Testbed for Dynamic Rule Exploration.pdf",
        "old_url": "",
        "title": "MiniStS: A Testbed for Dynamic Rule Exploration",
        "year": 2024
    },
    {
        "abstract": "Social simulation is a field with many challenges. On the one hand, simulations are deeply technical and challenging to work with, and yet they are also exceedingly varied. This position paper draws on existing literature to identify two ‘simulation rhetorics’ which enable interactive dramas, and other systems involving social models, to make compelling claims about our social lives. These are the appearance of emergent behavior and the experience of world-building, which each depend upon the dual role played by the interactive drama’s author as both its designer and its critic. In the process, we identify both technical threats and evaluation problems facing social simulation researchers, due in part to the high bar set by prior art. This paper seeks to collect craft knowledge on social simulation from throughout its history, in order to address what simulation does for reflective practitioners by enabling deep forms of expression.",
        "authors": "Jasmine T. Otto, Isaac J. Karth",
        "bibtex": "@inproceedings{otto2024toward,\ntitle={Toward Prose Performances: Reflective Practices in Social Simulation},\nauthor={Jasmine T. Otto, Isaac J. Karth},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper8.pdf",
        "local_file": "papers/Toward Prose Performances Reflective Practices in Social Simulation",
        "old_url": "",
        "title": "Toward Prose Performances: Reflective Practices in Social Simulation",
        "year": 2024
    },
    {
        "abstract": "Seeking to leverage Expressive Range Analysis (ERA)- a method of characterizing generative systems- for analysis of generative AI (GAI) systems and their outputs, this paper categorizes the approaches that have been used for ERA. We present a taxonomy with five axes of characterization that may be applied to ERA methodologies: content agnostic vs semantic; quantitative vs qualitative; product vs process; objective vs subjective; and automated vs manual. While ERA has traditionally been limited to the domain of Procedural Content Generation (PCG) in video game development, we recognize parallels between PCG and GAI and hope to see an expansion of the application of ERA into the domain of GAI. Serving this goal, these axes provide metrics through which to categorize, compare, and\nexplore approaches.",
        "authors": "Josiah Boucher, Gillian Smith and Yunus Doğan Telliel",
        "bibtex": "@inproceedings{boucher2024axes,\ntitle={Axes of Characterizing Generative Systems: A Taxonomy of Approaches to Expressive Range Analysis},\nauthor={Josiah Boucher, Gillian Smith and Yunus Doğan Telliel},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper9.pdf",
        "local_file": "papers/Axes of Characterizing Generative Systems A Taxonomy of Approaches to Expressive Range Analysis.pdf",
        "old_url": "",
        "title": "Axes of Characterizing Generative Systems: A Taxonomy of Approaches to Expressive Range Analysis",
        "year": 2024
    },
    {
        "abstract": "This paper describes an in-progress examination of the differences in observed perceptions and usability of generative AI (GAI) in MassDigi’s Summer Innovation Program (SIP) from 2023 to 2024. SIP is a professional development program where teams of interns create mobile games in the Unity game engine over an 11-week period. Following a previous study using ethnographic methods to\nexamine this topic in summer 2023, a similar study conducted in summer 2024 found dramatically different results. Where previously, interns broadly resisted the adoption of methods that incorporated GAI, the 2024 cohort was found to embrace the tools. This paper presents the differences in findings, explores possible explanations for these differences, and presents potential paths of research to further investigate the trajectory of GAI adoption amongst creative professionals. We also present four variables that may influence GAI adoption: experience, cultural context, proportion of artists within a community, and shifting societal paradigms.",
        "authors": "Josiah Boucher, Max Chen, Gillian Smith and Yunus Doğan Telliel",
        "bibtex": "@inproceedings{boucher2024examing,\ntitle={Examining the Trajectory of Early Professionals’ use of Generative AI in the Game Development Process from 2023 to 2024},\nauthor={Josiah Boucher, Max Chen, Gillian Smith and Yunus Doğan Telliel},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper10.pdf",
        "local_file": "papers/Examining the Trajectory of Early Professionals’ use of Generative AI in the Game Development Process from 2023 to 2024.pdf",
        "old_url": "",
        "title": "Examining the Trajectory of Early Professionals’ use of\nGenerative AI in the Game Development Process from 2023 to\n2024",
        "year": 2024
    },
    {
        "abstract": "This paper presents \"One Spell Fits All\", an AI-native game prototype where the player, playing as a witch, solves villagers’ problems using magical conjurations. We show how, beyond being a standalone game, \"One Spell Fits All\" could serve as a research platform to explore several key areas in AI-driven and AI-native game design. These areas include AI creativity, user experience in predominantly AI-generated content, and the energy efficiency of locally running versus cloud-based AI models. By leveraging smaller, locally running\ngenerative AI models, including LLMs and diffusion models for image generation, the game dynamically generates and evaluates content without the need for external APIs or internet access, offering a sustainable and responsive gameplay experience. This paper explores the application of LLMs in narrative video games, outlines a game prototype’s design and mechanics, and proposes future research opportunities that can be explored using the game as a platform.",
        "authors": "Tom Tucek, Kseniia Harshina, Georgia Samaritaki and Dipika Rajesh",
        "bibtex": "@inproceedings{tucek2024one,\ntitle={One Spell Fits All: A Generative AI Game as a Tool for Research in AI Creativity and Sustainable Design},\nauthor={Tom Tucek, Kseniia Harshina, Georgia Samaritaki and Dipika Rajesh},\nbooktitle={Proceedings of the AIIDE Workshop on Experimental AI in Games},\nyear={2024}}",
        "link": "https://ceur-ws.org/Vol-3926/paper11.pdf",
        "local_file": "papers/One Spell Fits All A Generative AI Game as a Tool for Research in AI Creativity and Sustainable Design.pdf",
        "old_url": "",
        "title": "One Spell Fits All: A Generative AI Game as a Tool for Research in AI Creativity and Sustainable Design",
        "year": 2024
    }
]